{"CHE230H1": {"LEC": 3.0, "PRA": 0.0, "description": "The chemical phenomena occurring in environmental systems are examined based on fundamental principles of organic, inorganic and physical chemistry. The course is divided into sections describing the chemistry of the atmosphere, natural waters and soils. The principles applied in the course include reaction kinetics and mechanisms, complex formation, pH and solubility equilibria and adsorption phenomena. Molecules of biochemical importance and instrumental methods of analysis relevant to environmental systems are also addressed. (formerly EDC230H1S)<br>\n<br>\n", "TUT": 2.0, "code": "CHE230H1", "wintersections": {"TUT0101": ["", "", "Evans, Gregory", [["SF3202", ["R", 12.0, 14.0]]]], "TUT0102": ["", "", "Evans, Gregory", [["HA403", ["W", 10.0, 12.0]]]], "LEC0101": ["", "", "Evans, Gregory", [["MC102", ["W", 17.0, 18.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "name": "Environmental Chemistry"}, "GGR221H1": {"LEC": 2.0, "PRA": 0.0, "description": "<p>Provides an introduction to economic geography and economic geography theory from the 1970s on, illustrating the different ways that geographers have conceptualized the restructuring of resource industries, manufacturing and services. The crisis of Fordism and the rise of new production models will be given particular attention, along with the reorganization of finance, the rise of cultural industries and the globalization of commodity chains. New regimes of governance of the economy will also be considered.</p><br>", "TUT": 0.0, "name": "New Economic Spaces", "code": "GGR221H1", "SC": ["S"], "CR": 0.5, "SEM": 0, "Exclusion": "GGR220Y1"}, "MIE253H1": {"LEC": 3.0, "PRA": 2.0, "description": "<p>This course provides an understanding of the principles and techniques of information modelling and data management, covering both relational theory and SQL database systems (DBMS), as well as entity-relation conceptual modelling. The course also familiarizes the student with analytical applications (OLAP) and provides an introduction to XML data modelling. The laboratory focuses on database application development using SQL DBMS, OLAP queries and entity-relation data modelling.</p><br>", "TUT": 0.0, "code": "MIE253H1", "wintersections": {"PRA0101": ["", "", "", [["RS303", ["F", 9.0, 10.0]]]], "LEC0101": ["", "", "Khatchadourian, Shahan", [["MP202", ["F", 11.0, 12.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#MIE250H1\">MIE250H1</a>", "name": "Data Modelling"}, "CSC373H1": {"LEC": 2.0, "PRA": 0.0, "description": "<p>Standard algorithm design techniques: divide-and-conquer, greedy strategies, dynamic programming, linear programming, randomization, network flows, approximation algorithms. Brief introduction to NP-completeness: polynomial time reductions, examples of various NP-complete problems, self-reducibility. Students will be expected to show good design principles and adequate skills at reasoning about the correctness and complexity of algorithms.</p><br>", "TUT": 1.0, "name": "Algorithm Design, Analysis ", "code": "CSC373H1", "SC": ["F", "S"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#CSC263H1\">CSC263H1</a>/<a href=\"Course_Descriptions.html#CSC265H1\">CSC265H1</a>", "Exclusion": "<a href=\"Course_Descriptions.html#CSC375H1\">CSC375H1</a>"}, "PHY293H1": {"LEC": 3.0, "PRA": 1.0, "description": "<p>The first half of the semester will give an introduction to the basic ideas of classical oscillations and waves. Topics include simple harmonic motion, forced and damped harmonic motion, coupled oscillations, normal modes, the wave equation, travelling waves and reflection and transmission at interfaces. The second half of the semester will first give an introduction to Einstein's special relativity, including evidence for the frame-independence of the speed of light, time dilation, length contraction, causality, and the relativistic connection between energy and momentum. Then we will follow the historical development of quantum mechanics with the photo-electric and Compton effects, the Bohr atom, wave-particle duality, leading to Schrdinger's equation and wave functions with a discussion of their general properties and probabilistic interpretation.</p><br>", "fallsections": {"PRA0101": ["", "", "", [["MP222", ["W", 9.0, 12.0]]]], "PRA0103": ["", "", "", [["MP222", ["W", 14.0, 17.0]]]], "PRA0102": ["", "", "", [["MP222", ["W", 9.0, 12.0]]]], "LEC0102": ["", "", "Lo, Hoi-Kwong and Krieger, Peter", [["MP203", ["F", 15.0, 16.0]]]], "PRA0104": ["", "", "", [["MP222", ["W", 14.0, 17.0]]]], "LEC0101": ["", "", "Lo, Hoi-Kwong and Krieger, Peter", [["MP203", ["F", 16.0, 17.0]]]], "TUT0101": ["", "", "", [["WB144", ["F", 13.0, 14.0]]]], "TUT0103": ["", "", "", [["WB144", ["W", 16.0, 17.0]]]], "TUT0102": ["", "", "", [["BA2159", ["F", 13.0, 14.0]]]], "TUT0105": ["", "", "", [["WB144", ["R", 11.0, 12.0]]]], "TUT0104": ["", "", "", [["BA2159", ["W", 16.0, 17.0]]]], "TUT0107": ["", "", "", [["WB144", ["R", 14.0, 15.0]]]], "TUT0106": ["", "", "", [["BA2159", ["R", 11.0, 12.0]]]], "TUT0108": ["", "", "", [["BA2159", ["R", 14.0, 15.0]]]]}, "TUT": 1.0, "code": "PHY293H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "name": "Waves and Modern Physics"}, "APS301H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p><strong>Humanities and Social Science Elective</strong><br /></br>This course teaches future engineers to look beyond their specialized domains of expertise in order to understand how technology functions within human life, society and the biosphere. By providing this context for design and decision-making, students will be enabled to do more than achieve the desired results by also preventing or significantly reducing undesired consequences. A more preventively-oriented mode of practicing engineering will be developed in four areas of application: materials and production, energy, work and cities. The emphasis within these topics will reflect the interests of the class.</p><br>", "fallsections": {"TUT0101": ["", "", "", [["MB128", ["W", 11.0, 12.0]]]], "LEC0101": ["", "", "Vanderburg, Willem", [["SF1105", ["T", 11.0, 14.0]]]]}, "TUT": 1.0, "code": "APS301H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "name": "Technology in Society and the Biosphere I"}, "CIV360H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>A deep understanding of the behaviour and performance of road systems is fundamental to transportation engineering and planning. This course provides an in-depth exploration of the performance characteristics of highway and street systems that provides the basis for the design of road networks and operating systems, including Intelligent Transportation Systems for real-time control of roadways. Theoretical principles and practical applications concerning roadway performance are discussed, including facility capacity, speed-flow relationships, operational control, measurement of performance and safety. Driver behaviour and route choice and the demand-supply relationship between driver behaviour and system performance are examined in detail. Non-motorized (walking and cycling) system performance is also introduced.</p><br>", "TUT": 1.0, "code": "CIV360H1", "wintersections": {"TUT0101": ["", "", "", [["BAB024", ["M", 9.0, 10.0]]]], "LEC0101": ["", "", "Miller, Eric", [["BAB024", ["M", 10.0, 11.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "name": "Road Transportation Performance"}, "AER521H1": {"LEC": 3.0, "PRA": 1.5, "description": "<p>The course addresses fundamentals of mobile robotics and sensor-based perception for applications such as space exploration, search and rescue, mining, self-driving cars, unmanned aerial vehicles, autonomous underwater vehicles, etc. Topics include sensors and their principles, state estimation, computer vision, control architectures, localization, mapping, planning, path tracking, and software frameworks. Laboratories will be conducted using both simulations and hardware kits.</p><br>", "TUT": 1.0, "Recommended Preparation": "<a href=\"Course_Descriptions.html#AER372H1\">AER372H1</a>", "code": "AER521H1", "wintersections": {"PRA0101": ["", "", "Barfoot, Tim", [["BA2155", ["R", 9.0, 12.0]]]], "TUT0101": ["", "", "Barfoot, Tim", [["BA2145", ["M", 18.0, 19.0]]]], "LEC0101": ["", "", "Barfoot, Tim", [["BA2145", ["M", 17.0, 18.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "name": "Mobile Robotics and Perception"}, "CHE499Y1": {"LEC": 0.0, "PRA": 7.0, "description": "<p>The course consists of a research project conducted under the supervision of a senior staff member. The project may have an experimental, theoretical or design emphasis. Each thesis will contain a minimum 60% combined Engineering Science and Engineering Design (with a minimum of 10% in each component). This course is open to students with permission of the Department and research project supervisor.</p><br>", "TUT": 0.0, "code": "CHE499Y1", "SC": ["Y"], "CR": 1.0, "SEM": 0, "name": "Thesis"}, "CHE466H1": {"LEC": 3.0, "PRA": 0.66, "description": "<p>An introduction to the biological and engineering principles relevant to the processing of biological materials and to processing using biological agents, such as cells, enzymes or antibodies. Topics to be covered include elementary microbiology, enzyme kinetics, immobilization of biocatalysts, bioreactor design/analysis and bioseparation processes.</p><br>", "TUT": 1.0, "code": "CHE466H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#CHE353H1\">CHE353H1</a>", "name": "Bioprocess Engineering"}, "CIV517H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>An introduction to procedures for predicting the load-deformation response of prestressed concrete elements and structures with emphasis on how these procedures can be used in the design of new structures and in the evaluation of existing structures. Topics include: prestressing technology; control of cracking; response to axial load and flexure; response to shear and torsion; disturbed regions; restraint of deformations; design codes.</p><br>", "fallsections": {"TUT0101": ["", "", "", [["GB405", ["T", 12.0, 14.0]]]], "LEC0101": ["", "", "Collins, Michael", [["WB130", ["W", 11.0, 12.0]]]]}, "TUT": 0.0, "code": "CIV517H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#CIV313H1\">CIV313H1</a> or <a href=\"Course_Descriptions.html#CIV357H1\">CIV357H1</a> or equivalent.", "name": "Prestressed Concrete"}, "CME185H1": {"LEC": 3.0, "PRA": 2.0, "description": "<p>This course introduces students to the basic earth sciences with an emphasis on understanding the impact of humans on the natural earth systems. Beginning with a study of the lithosphere, principles of physical geology will be examined including the evolution and internal structure of the earth, dynamic processes that affect the earth, formation of minerals and rocks and soil, ore bodies and fossil- energy sources. Next, the biosphere will be studied, including the basic concepts of ecology including systems ecology and biogeochemical cycles. The influence of humans and the built environment on these natural systems will also be examined with a view to identifying more sustainable engineering practices. Finally, students will study the oceans and the atmosphere and the physical, chemical and thermodynamic processes involved in climate change.</p><br>", "TUT": 1.0, "code": "CME185H1", "wintersections": {"PRA0101": ["", "", "", [["ES1067", ["W", 15.0, 17.0]]]], "TUT0101": ["", "", "", [["SF1105", ["R", 11.0, 12.0]]]], "PRA0102": ["", "", "", [["ES1067", ["F", 15.0, 17.0]]]], "LEC0101": ["", "", "Peterson, Karl", [["WB116", ["F", 10.0, 11.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "name": "Earth Systems Science"}, "MIE100H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>This course on Newtonian mechanics considers the interactions which influence 2-D, curvilinear motion. These interactions are described in terms of the concepts of force, work, momentum and energy. Initially the focus is on the kinematics and kinetics of particles. Then, the kinematics and kinetics of systems of particles and solid bodies are examined. Finally, simple harmonic motion is discussed. The occurrence of dynamic motion in natural systems, such as planetary motion, is emphasized. Applications to engineered systems are also introduced.</p><br>", "TUT": 2.0, "name": "Dynamics", "code": "MIE100H1", "wintersections": {"LEC0106": ["", "", "Sullivan, Pierre", [["TZ6", ["F", 15.0, 16.0]]]], "LEC0104": ["", "", "Sinclair, Anthony", [["WB116", ["M", 15.0, 16.0]]]], "LEC0105": ["", "", "Sinclair, Anthony", [["BA1190", ["F", 14.0, 15.0]]]], "LEC0102": ["", "", "Simmons, Craig", [["MC254", ["T", 10.0, 11.0]]]], "LEC0103": ["", "", "You, Lidan", [["BA1190", ["F", 15.0, 16.0]]]], "LEC0101": ["", "", "Young, Edmond", [["MC252", ["W", 10.0, 11.0]]]], "TUT0101": ["", "", "", [["BA2145", ["W", 13.0, 15.0]]]], "TUT0103": ["", "", "", [["SF3202", ["M", 13.0, 15.0]]]], "TUT0102": ["", "", "", [["BA1220", ["R", 16.0, 18.0]]]], "TUT0105": ["", "", "", [["HA410", ["W", 9.0, 11.0]]]], "TUT0104": ["", "", "", [["HA401", ["W", 9.0, 11.0]]]], "TUT0107": ["", "", "", [["SF3202", ["R", 16.0, 18.0]]]], "TUT0106": ["", "", "", [["SF3202", ["W", 9.0, 11.0]]]], "TUT0109": ["", "", "", [["HA410", ["M", 13.0, 15.0]]]], "TUT0108": ["", "", "", [["GB412", ["W", 13.0, 15.0]]]], "TUT0110": ["", "", "", [["BA2175", ["W", 9.0, 11.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "Exclusion": "<a href=\"Course_Descriptions.html#APS161H1\">APS161H1</a>"}, "JGA305H1": {"LEC": 2.0, "PRA": 1.0, "description": "<p>Application of near-surface geophysical methods to investigate environmental and archaeological sites; in particular magnetometry, resistivity, ground-probing radar, and seismic surveys. Course will cover background on the various methods, and allow students to run field surveys and present on case studies.</p><br>", "fallsections": {"LEC5101": ["", "", "", [["ES1062", ["M", 17.0, 20.0]]]]}, "TUT": 0.0, "code": "JGA305H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#ESS241H1\">ESS241H1</a> or <a href=\"Course_Descriptions.html#ANT200Y1\">ANT200Y1</a> or <a href=\"Course_Descriptions.html#GGR201H1\">GGR201H1</a>", "name": "Environmental and Archaeological Geophysics"}, "RSM434H1": {"LEC": 2.0, "PRA": 0.0, "description": "<p>This course will use finance theory applied with Excel applications to understand potential returns and risks inherent in particular investment/trading strategies. Learning-by-doing will be facilitated by simulation-based <em>Rotman Interactive Trader </em>cases focused on particular risks. This training will be analogous to using a flight simulator for learning to fly. Not eligible for CR/NCR option. Contact Rotman Commerce for details.</p><br>", "TUT": 0.0, "name": "Financial Trading Strategies (formerly RSM412H1 Financial Trading Strategies) ", "code": "RSM434H1", "wintersections": {"LEC2001": ["", "", "", [["", ["M", 15.0, 17.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#RSM332H1\">RSM332H1</a>", "Exclusion": "<a href=\"Course_Descriptions.html#RSM412H1\">RSM412H1</a> Financial Trading Strategies"}, "MIN467H1": {"LEC": 1.0, "PRA": 4.0, "description": "<p>Mineral Project Design is a two-part capstone course that draws on all course materials developed in the first three years of the Mineral Engineering Curriculum. Part II (S) focuses on the design of a mining or civil rock engineering project. Students will be grouped into teams and provided with one or more data sets and a design problem to solve. The end product is a major engineering design report and oral presentation (including several interim reports and presentations). Technical aspects will serve to examine a cradle to grave view of a project, from initial planning through to final closure and site remediation. The course will include an intensive two-day Professional Supervisors Short Course. Topics include: Discovering a commonality among supervisors and their key role in maintaining standards. The importance of sharing information and expectations about costs, production goals and business objectives are explored in the context of motivation. The necessity of successful communication skills and techniques are discussed and demonstrated to achieve behaviours on the job, producing consistent results. A reliable methodology for handling difficult situations is provided. The fundamental rationale for safety and loss control is presented as well as a relevant perspective on management structure. A workable code of conduct that is a guide to professional behaviour is developed. Students will receive a final grade at the end of each term course, but both courses must be taken in sequence (MIN 467H1 S cannot be taken without successful completion of MIN 466H1 F)</p><br>", "TUT": 1.0, "code": "MIN467H1", "wintersections": {"PRA0101": ["", "", "Esmaeili, Kamran", [["MB402", ["R", 14.0, 18.0]]]], "TUT0101": ["", "", "Esmaeili, Kamran", [["MB500", ["M", 16.0, 17.0]]]], "LEC0101": ["", "", "Esmaeili, Kamran", [["MB500", ["M", 15.0, 16.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#MIN466H1\">MIN466H1</a>", "name": "Mineral Project Design II"}, "CHM434H1": {"LEC": 2.0, "PRA": 0.0, "description": "<p>A comprehensive investigation of synthetic methods for preparing diverse classes of inorganic materials with properties intentionally tailored for a particular use. Begins with a primer on solid-state materials and electronic band description of solids followed by a survey of archetypical solids that have had a dramatic influence on the materials world, some new developments in materials chemistry and a look at perceived future developments in materials research and technology. Strategies for synthesizing many different classes of materials with intentionally designed structures and compositions, textures and morphologies are then explored in detail emphasizing how to control the relations between structure and property of materials and ultimately function and utility. A number of contemporary issues in materials research are critically evaluated to appreciate recent highlights in the field of materials chemistry - an emerging sub-discipline of chemistry.</p><br>", "fallsections": {"LEC2001": ["", "", "", [["LM161", ["R", 16.0, 18.0]]]]}, "TUT": 0.0, "code": "CHM434H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#CHM325H1\">CHM325H1</a>, <a href=\"Course_Descriptions.html#CHM338H1\">CHM338H1</a>", "name": "Advanced Materials Chemistry"}, "ECE470H1": {"LEC": 3.0, "PRA": 1.5, "description": "<p>Classification of robot manipulators, kinematic modeling, forward and inverse kinematics, velocity kinematics, path planning, point-to-point trajectory planning, dynamic modeling, Euler-Langrange equations, inverse dynamics, joint control, computed torque control, passivity-based control, feedback linearization.</p><br>", "TUT": 1.0, "name": "Robot Modeling and Control", "code": "ECE470H1", "wintersections": {"PRA0101": ["", "", "", [["BA3114", ["T", 9.0, 12.0]]]], "PRA0103": ["", "", "", [["BA3114", ["T", 12.0, 15.0]]]], "PRA0102": ["", "", "", [["BA3114", ["T", 9.0, 12.0]]]], "PRA0105": ["", "", "", [["BA3114", ["F", 9.0, 12.0]]]], "PRA0104": ["", "", "", [["BA3114", ["T", 12.0, 15.0]]]], "LEC0101": ["", "", "Maggiore, Manfredi", [["BA1220", ["R", 14.0, 15.0]]]], "TUT0101": ["", "", "", [["GB405", ["R", 12.0, 14.0]]]], "PRA0106": ["", "", "", [["BA3114", ["F", 9.0, 12.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#ECE311H1\">ECE311H1</a> or <a href=\"Course_Descriptions.html#ECE356H1\">ECE356H1</a>", "Exclusion": "<a href=\"Course_Descriptions.html#AER525H1\">AER525H1</a>"}, "CSC384H1": {"LEC": 2.0, "PRA": 0.0, "description": "<p>Theories and algorithms that capture (or approximate) some of the core elements of computational intelligence. Topics include: search; logical representations and reasoning, classical automated planning, representing and reasoning with uncertainty, learning, decision making (planning) under uncertainty. Assignments provide practical experience, both theory and programming, of the core topics.</p><br>", "fallsections": {"LEC2001": ["", "", "", [["SS2102", ["R", 13.0, 15.0]]]]}, "TUT": 1.0, "Recommended Preparation": "<a href=\"Course_Descriptions.html#CSC324H1\">CSC324H1</a>", "code": "CSC384H1", "SC": ["F", "S"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#CSC263H1\">CSC263H1</a>/<a href=\"Course_Descriptions.html#CSC265H1\">CSC265H1</a>, <a href=\"Course_Descriptions.html#STA247H1\">STA247H1</a>/<a href=\"Course_Descriptions.html#STA255H1\">STA255H1</a>/<a href=\"Course_Descriptions.html#STA257H1\">STA257H1</a>", "name": "Introduction to Artificial Intelligence"}, "HPS201H1": {"LEC": 2.0, "PRA": 0.0, "description": "<p>Technology and its place in our culture from Antiquity to the beginnings of the Industrial Revolution. Relations between technology and science, religion, the arts, social institutions, and political beliefs.</p><br>", "TUT": 2.0, "code": "HPS201H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "name": "Origins of Western Technology"}, "CIV313H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>This course provides an introduction to the design of reinforced concrete structures. Concrete technology, properties of concrete and reinforcing steel, construction practice, and general code requirements are discussed. Analysis and design of members under axial load, flexure, shear, and restraint force are examined in detail. Other aspects of design covered include control of cracks, minimum and maximum reinforcement ratios, fire resistance, durability, distress and failure. A major design project, done in teams of two and accounting for 15% of the final mark, requires students to formulate a complete design for a structural system such as a pedestrian bridge or floor system. Project requirements include consideration of alternative designs in terms of structural efficiency and total costs.</p><br>", "TUT": 2.0, "code": "CIV313H1", "wintersections": {"TUT0101": ["", "", "Vecchio, Frank", [["HA403", ["F", 12.0, 14.0]]]], "LEC0101": ["", "", "Vecchio, Frank", [["SF1101", ["W", 16.0, 18.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#CIV312H1\">CIV312H1</a>", "name": "Reinforced Concrete I"}, "HPS202H1": {"LEC": 2.0, "PRA": 0.0, "description": "<p>A survey of technical change and its social implications from the Industrial Revolution to the present.</p><br>", "TUT": 2.0, "Recommended Preparation": "<a href=\"Course_Descriptions.html#HPS201H1\">HPS201H1</a>", "code": "HPS202H1", "SC": ["S"], "CR": 0.5, "SEM": 0, "name": "Technology in the Modern World"}, "ESS423H1": {"LEC": 2.0, "PRA": 3.0, "description": "<p>Geology and geochemistry of ore deposits. Origin and interpretation; systematic ore mineralogy, in hand specimen and reflected light microscopy.</p><br>", "fallsections": {"LEC0101": ["", "", "", [["ES2111", ["T", 14.0, 17.0]]]]}, "TUT": 0.0, "name": "Mineral Deposits", "code": "ESS423H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#ESS322H1\">ESS322H1</a>", "Exclusion": "GLG442H1"}, "ECE221H1": {"LEC": 3.0, "PRA": 1.0, "description": "<p>The fundamental laws of electromagnetics are covered, including Coulomb's law, Gauss' law, Poisson's and Laplace's equations, the Biot-Savart law, Ampere's law, Faraday's law, and Maxwell's equations. Vector calculus is applied to determine the relationship between the electric and magnetic fields and their sources (charges and currents). The interaction of the fields with material media will be discussed, including resistance, polarization in dielectrics, magnetization in magnetic materials, properties of magnetic materials and boundary conditions. Other topics include: electric and magnetic forces, the electric potential, capacitance and inductance, electric and magnetic energy, magnetic circuits, and boundary-value problems.</p><br>", "TUT": 2.0, "code": "ECE221H1", "wintersections": {"TUT0106": ["", "", "", [["GB404", ["F", 9.0, 11.0]]]], "PRA0101": ["", "", "", [["GB251", ["W", 16.0, 18.0]]]], "PRA0105": ["", "", "", [["SF2102", ["T", 9.0, 11.0]]]], "PRA0103": ["", "", "", [["SF2102", ["R", 13.0, 15.0]]]], "PRA0102": ["", "", "", [["GB251", ["W", 16.0, 18.0]]]], "LEC0102": ["", "", "Stickel, Micah", [["BA1130", ["R", 10.0, 11.0]]]], "LEC0103": ["", "", "Stickel, Micah", [["BA1130", ["M", 11.0, 12.0]]]], "LEC0101": ["", "", "Shokrollah-Timorabadi, Hamid", [["BA1180", ["R", 13.0, 14.0]]]], "TUT0101": ["", "", "", [["GB404", ["R", 9.0, 11.0]]]], "TUT0103": ["", "", "", [["GB304", ["F", 13.0, 15.0]]]], "TUT0102": ["", "", "", [["GB412", ["R", 9.0, 11.0]]]], "TUT0105": ["", "", "", [["SF3201", ["F", 9.0, 11.0]]]], "TUT0104": ["", "", "", [["SF3201", ["F", 13.0, 15.0]]]], "PRA0106": ["", "", "", [["SF2102", ["T", 15.0, 17.0]]]], "PRA0104": ["", "", "", [["GB251", ["R", 13.0, 15.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "name": "Electric and Magnetic Fields"}, "ECE350H1": {"LEC": 3.0, "PRA": 1.5, "description": "<p>An explanation of the basic operation, design and limitations of semiconductor electronic devices, such as diodes and transistors. The topics covered include: electrons in semiconductors, semiconductors in equilibrium, transport of carriers, p-ndiodes, metal-semiconductor contacts, bipolar junction transistors, metal-oxide-semiconductor (MOS) capacitors, and MOS field effect transistors.In addition, optoelectronic devices (e.g. photodiodes, light emitting diodes and lasers), semiconductor heterostructures, nanostructures and transistor scaling will be discussed.</p><br>", "TUT": 1.0, "code": "ECE350H1", "wintersections": {"PRA0101": ["", "", "", [["SF2201", ["T", 15.0, 18.0]]]], "TUT0101": ["", "", "", [["BA1230", ["R", 9.0, 10.0]]]], "PRA0103": ["", "", "", [["SF2201", ["T", 15.0, 18.0]]]], "PRA0102": ["", "", "", [["SF2201", ["W", 18.0, 21.0]]]], "LEC0101": ["", "", "Voinigescu, Sorin", [["RS310", ["R", 13.0, 14.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "name": "Semiconductor Electronic Devices"}, "CHE353H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>Using a quantitative, problem solving approach, this course will introduce basic concepts in cell biology and physiology. Various engineering modelling tools will be used to investigate aspects of cell growth and metabolism, transport across cell membranes, protein structure, homeostasis, nerve conduction and mechanical forces in biology. <br /></br>Exclusion: BME105H1</p><br>", "fallsections": {"TUT0101": ["", "", "", [["HA410", ["R", 13.0, 14.0]]]], "TUT0103": ["", "", "", [["BA2195", ["M", 10.0, 11.0]]]], "TUT0102": ["", "", "", [["BA2195", ["T", 16.0, 17.0]]]], "TUT0104": ["", "", "", [["BA2195", ["W", 11.0, 12.0]]]], "LEC0101": ["", "", "Sefton, Michael", [["TZ6", ["R", 14.0, 15.0]]]]}, "TUT": 1.0, "code": "CHE353H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "name": "Engineering Biology"}, "CHE324H1": {"LEC": 3.0, "PRA": 4.0, "description": "<p>This course presents the philosophy and typical procedures of chemical engineering design projects. The course begins at the design concept phase. Material and energy balances are reviewed along with the design of single unit operations and equipment specification sheets. The impact of recycles on equipment sizing is covered. Safety, health and environmental regulations are presented. These lead to the development of safe operating procedures. The systems for developing Piping and Instrumentation diagrams are presented. Process safety studies such as HAZOPS are introduced. Typical utility systems such as steam, air and vacuum are discussed. Project economics calculations are reviewed.</p><br>", "fallsections": {"PRA0101": ["", "", "", [["WB25", ["F", 10.0, 13.0]]]], "PRA0103": ["", "", "", [["WB25", ["F", 10.0, 13.0]]]], "PRA0102": ["", "", "Jowlabar, Chatterpaul", [["WB25", ["T", 13.0, 16.0]]]], "LEC0101": ["", "", "Norval, Graeme", [["MB128", ["W", 9.0, 10.0]]]], "TUT0101": ["", "", "Norval, Graeme", [["GB150", ["M", 12.0, 14.0]]]], "TUT0102": ["", "", "Norval, Graeme", [["GB144", ["T", 16.0, 18.0]]]]}, "TUT": 2.0, "code": "CHE324H1", "SC": ["F"], "CR": 0.75, "SEM": 0, "name": "Process Design"}, "MSE238H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>This course will teach engineering statistics and numerical methods with MATLAB. Topics on statistics will include probability theory, hypothesis testing, discrete and continuous distribution, analysis of variance, sampling distributions, parameter estimation and regression analysis. The topics on numerical methods will include curve fitting and interpolation, numerical differentiation and integration, solution of ordinary and partial differential equations, initial and boundary value problems, finite difference and finite element methods.</p>\r\n<p></p><br>", "TUT": 2.0, "code": "MSE238H1", "wintersections": {"TUT0101": ["", "", "", [["GB244", ["W", 14.0, 15.0]]]], "LEC0101": ["", "", "Singh, Chandra Veer", [["MC252", ["R", 15.0, 16.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "name": "Engineering Statistics and Numerical Methods"}, "MAT290H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>An introduction to complex variables and ordinary differential equations. Topics include: Laplace transforms, ordinary higher-order linear differential equations with constant coefficients; transform methods; complex numbers and the complex plane; complex functions; limits and continuity; derivatives and integrals; analytic functions and the Cauchy-Riemann equations; power series as analytic functions; the logarithmic and exponential functions; Cauchy's integral theorem, Laurent series, residues, Cauchy's integral formula, the Laplace transform as an analytic function. Examples are drawn from electrical systems.</p><br>", "fallsections": {"LEC0102": ["", "", "Homayouni-Boroojeni, Soheil", [["BA1180", ["R", 15.0, 16.0]]]], "LEC0103": ["", "", "Cohen, Shai", [["MC254", ["R", 10.0, 11.0]]]], "LEC0101": ["", "", "Pavel, Lacra", [["BA1180", ["M", 14.0, 15.0]]]], "TUT0101": ["", "", "", [["GB304", ["W", 9.0, 11.0]]]], "TUT0103": ["", "", "", [["GB303", ["F", 13.0, 15.0]]]], "TUT0102": ["", "", "", [["GB404", ["W", 9.0, 11.0]]]], "TUT0105": ["", "", "", [["GB304", ["F", 13.0, 15.0]]]], "TUT0104": ["", "", "", [["SF2202", ["F", 13.0, 15.0]]]], "TUT0106": ["", "", "", [["GB404", ["F", 13.0, 15.0]]]]}, "TUT": 2.0, "code": "MAT290H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "name": "Advanced Engineering Mathematics"}, "MIE457H1": {"LEC": 3.0, "PRA": 1.0, "description": "<p>This course explores both the modelling of knowledge and its management within and among organizations. Knowledge modelling will focus on knowledge types and their semantic representation. It will review emerging representations for knowledge on the World Wide Web (e.g., schemas, RDF). Knowledge management will explore the acquisition, indexing, distribution and evolution of knowledge within and among organizations. Emerging Knowledge Management System software will be used in the laboratory.</p><br>", "TUT": 1.0, "code": "MIE457H1", "wintersections": {"PRA0101": ["", "", "", [["GB144", ["M", 12.0, 13.0]]]], "TUT0101": ["", "", "", [["HA403", ["R", 10.0, 11.0]]]], "LEC0101": ["", "", "Gruninger, Michael", [["RS208", ["R", 14.0, 15.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#MIE253H1\">MIE253H1</a>, <a href=\"Course_Descriptions.html#MIE350H1\">MIE350H1</a>", "name": "Knowledge Modelling and Management"}, "MIE542H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>The integration of human factors into engineering projects. Human factors integration (HFI) process and systems constraints, HFI tools, and HFI best practices. Modelling, economics, and communication of HFI problems. Examples of HFI drawn from energy, healthcare, military, and software systems. Application of HFI theory and methods to a capstone design project, including HFI problem specification, concept generation, and selection through an iterative and open-ended design process.</p><br>", "TUT": 2.0, "code": "MIE542H1", "wintersections": {"TUT0101": ["", "", "", [["BA2175", ["M", 16.0, 18.0]]]], "LEC0101": ["", "", "Iwasa-Madge, Kim and Leger, Robert", [["BA2145", ["T", 18.0, 21.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#MIE240H1\">MIE240H1</a>/ MIE1411H1/ equivalent or permission from the instructor.", "name": "Human Factors Integration"}, "MIE488H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>A complete introduction to small business formation, management and wealth creation. Topics include: the nature of the Entrepreneur and the Canadian business environment; business idea search and Business Plan construction; Buying a business, franchising, taking over a family business; Market research and sources of data; Marketing strategies promotion, pricing, advertising, electronic channels and costing; The sales process and management, distribution channels and global marketing; Accounting, financing and analysis, sources of funding, and financial controls; The people dimension: management styles, recruiting and hiring, legal issues in employment and Human Resources; Legal forms of organization and business formation, taxation, intellectual property protection; the e-Business world and how businesses participate; Managing the business: location and equipping the business, suppliers and purchasing, credit, ethical dealing; Exiting the business and succession, selling out. A full Business Plan will be developed by each student and the top submissions will be entered into a Business Plan competition with significant cash prices for the winners. Examples will be drawn from real business situations including practicing entrepreneurs making presentations and class visits during the term. (Identical courses are offered: <a href=\"Course_Descriptions.html#ECE488H1\">ECE488H1</a>F, <a href=\"Course_Descriptions.html#MSE488H1\">MSE488H1</a>F, <a href=\"Course_Descriptions.html#CHE488H1\">CHE488H1</a>S and <a href=\"Course_Descriptions.html#CIV488H1\">CIV488H1</a>S.) </p><br>", "fallsections": {"TUT0101": ["", "", "", [["BA1130", ["T", 12.0, 14.0]]]], "LEC0101": ["", "", "Orozco, Joseph", [["GB303", ["M", 18.0, 21.0]]]]}, "TUT": 2.0, "name": "Entrepreneurship and Business for Engineers", "code": "MIE488H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "Exclusion": "APS234 and APS432"}, "CME362H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>This course continues the study of numerical and analytical methods for civil engineering analysis. Analytical and numerical methods for solving ordinary differential equations are treated in some detail, followed by numerical solution methods for partial differential equations. The final major topic of the course deals with an introduction to optimization. Emphasis is placed throughout the course on problem formulation, solution algorithm design and programming applications.</p><br>", "TUT": 2.0, "name": "Engineering Mathematics II", "code": "CME362H1", "wintersections": {"TUT0101": ["", "", "", [["MP203", ["F", 9.0, 11.0]]]], "TUT0103": ["", "", "", [["MP203", ["F", 9.0, 11.0]]]], "TUT0102": ["", "", "", [["MP203", ["F", 9.0, 11.0]]]], "LEC0101": ["", "", "Abdulazim, Tamer", [["MB128", ["R", 9.0, 10.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "Exclusion": "CIV362H1"}, "ENV350H1": {"LEC": 0.0, "PRA": 0.0, "description": "<p>The course addresses: (1) physical, technological and economic aspects of energy and electricity systems and their associated environmental impacts; (2) current international, Canadian and Ontario energy policy; (3) technological, economic and political factors influencing policy which could significantly reduce environmental impacts of energy use.</p><br>", "TUT": 0.0, "code": "ENV350H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "Prerequisite": "(<a href=\"Course_Descriptions.html#ENV221H1\">ENV221H1</a>,<a href=\"Course_Descriptions.html#ENV222H1\">ENV222H1</a>/GGR222H1)/ENV222Y1/GGR222Y1/JGE221Y1 or permission of Undergraduate Coordinator", "name": "Energy Policy and Environment"}, "CIV282H1": {"LEC": 1.0, "PRA": 0.0, "description": "<p>This course develops students communications skills focusing on the specific skills required for work in foundational civil engineering. Target communication areas include: Oral Presentation; Logical Argument; Document Development; Sentence and Discourse Control; and Visual Design. The course will build capacity in support of specific assignments delivered in other courses in the same term.</p><br>", "fallsections": {"LEC0101": ["", "", "Chong, Alan", [["GB220", ["F", 14.0, 15.0]]]], "TUT0101": ["", "", "", [["WB258", ["F", 15.0, 16.0]]]], "TUT0103": ["", "", "", [["BA2159", ["F", 15.0, 16.0]]]], "TUT0102": ["", "", "", [["BA3008", ["F", 15.0, 16.0]]]], "TUT0105": ["", "", "", [["SF3202", ["F", 15.0, 16.0]]]], "TUT0104": ["", "", "", [["HA403", ["F", 15.0, 16.0]]]]}, "TUT": 1.0, "code": "CIV282H1", "SC": ["F"], "CR": 0.2, "SEM": 0, "name": "Engineering Communications I"}, "ECE358H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>Fundamentals of algorithm design and computational complexity, including: analysis of algorithms, graph algorithms, greedy algorithms, divide-and-conquer, dynamic programming, network flow, approximation algorithms, the theory of NP-completeness, and various NP-complete problems.</p><br>", "TUT": 1.0, "code": "ECE358H1", "wintersections": {"TUT0101": ["", "", "", [["GB304", ["M", 17.0, 18.0]]]], "LEC0101": ["", "", "Poulos, Zissis", [["BA1210", ["R", 12.0, 13.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "name": "Foundations of Computing"}, "MIE498Y1": {"LEC": 0.0, "PRA": 0.0, "description": "<p>An opportunity to conduct independent research under the supervision of a faculty member in MIE. Admission to the course requires the approval of a project proposal by the Undergraduate office. The proposal must: 1) Explain how the research project builds upon one or more aspects of engineering science introduced in the student's academic program, 2) provide an estimate of a level of effort not less than 40 productive hours of work per term, 3) specify a deliverable in each term to be submitted by the last day of lectures, 4) be signed by the supervisor, and 5) be received by the Undergraduate Office one week prior to the last add day.<br /></br><br /></br>Note: Approval to register for the fourth-year thesis course must be obtained from the Associate Chair  Undergraduate and is normally restricted to students with an overall average of at least B in their second and third years.</p><br>", "fallsections": {"TUT0101": ["", "", "", [["", ["F", 8.0, 9.0]]]]}, "TUT": 4.0, "code": "MIE498Y1", "SC": ["Y"], "CR": 1.0, "SEM": 0, "Prerequisite": "Approval to register for the fourth-year thesis course must be obtained from the Associate Chair – Undergraduate and is normally restricted to students with an overall average of at least B in their second and third years.", "name": "Research Thesis"}, "CME368H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>The incorporation of economic and non-monetary considerations for making decision about public and private sector engineering systems in urban and other contexts. Topics include rational decision making; cost concepts; time value of money and engineering economics; microeconomic concepts; treatment of risk and uncertainty; and public project evaluation techniques incorporating social and environmental impacts including benefit cost analysis and multi-objective analysis.</p><br>", "fallsections": {"LEC5101": ["", "", "Fernandez, Eduardo", [["BA1230", ["U", 9.0, 13.0]]]], "TUT0101": ["", "", "", [["GB119", ["W", 10.0, 11.0]]]], "TUT0102": ["", "", "", [["SF3202", ["W", 10.0, 11.0]]]], "LEC0101": ["", "", "Kennedy, Christopher", [["WB116", ["T", 13.0, 14.0]]]]}, "TUT": 1.0, "name": "Engineering Economics and Decision Making", "code": "CME368H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "Exclusion": "CIV368H1"}, "CSC318H1": {"LEC": 2.0, "PRA": 0.0, "description": "<p>User-centred design of interactive systems; methodologies, principles, and metaphors; task analysis. Interdisciplinary design; the role of graphic design, industrial design, and the behavioural sciences. Interactive hardware and software; concepts from computer graphics. Typography, layout, colour, sound, video, gesture, and usability enhancements. Classes of interactive graphical media; direct manipulation systems, extensible systems, rapid prototyping tools. Students work on projects in interdisciplinary teams. Enrolment limited, but non-computer scientists welcome.</p><br>", "fallsections": {"LEC2001": ["", "", "", [["UC179", ["R", 12.0, 15.0]]]]}, "TUT": 1.0, "Recommended Preparation": "<a href=\"Course_Descriptions.html#CSC300H1\">CSC300H1</a> provides useful background for work in <a href=\"Course_Descriptions.html#CSC318H1\">CSC318H1</a>, so if you plan to take <a href=\"Course_Descriptions.html#CSC300H1\">CSC300H1</a> then you should do it before <a href=\"Course_Descriptions.html#CSC318H1\">CSC318H1</a>", "code": "CSC318H1", "SC": ["F", "S"], "CR": 0.5, "SEM": 0, "Prerequisite": "Any CSC half-course", "name": "The Design of Interactive Computational Media"}, "AER310H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>Basic introduction to compressible gasdynamics. Includes some fundamental thermodynamics, thermal and caloric equations of state, derivation of Eulers equations by control volume approach. Also, includes the theory of steady flows in ducts with area changes, adiabatic frictional flows, duct flows with heat transfer, normal and oblique shock waves, Prandtl-Meyer expansion wave, moving shock and rarefaction waves, shock tubes, and wind tunnels. The lectures are supplemented by problem sets. Reference book: Anderson, J.D., Modern Compressible Flow with Historical Perspective.</p><br>", "TUT": 1.0, "Recommended Preparation": "<a href=\"Course_Descriptions.html#AER307H1\">AER307H1</a>", "code": "AER310H1", "wintersections": {"TUT0101": ["", "", "Groth, Clinton", [["RS310", ["R", 11.0, 12.0]]]], "LEC0101": ["", "", "Groth, Clinton", [["RS310", ["R", 10.0, 11.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "name": "Gasdynamics"}, "MIE262H1": {"LEC": 3.0, "PRA": 2.0, "description": "<p>Introduction to deterministic operations research. Formulations of mathematical models to improve decision making; linear and integer programming; the simplex method; the revised simplex method; branch-and-bound methods; sensitivity analysis; duality; network models; network simplex method; Dijkstra's algorithm; basic graph theory; and deterministic dynamic programming.</p><br>", "fallsections": {"PRA0101": ["", "", "", [["RS303", ["M", 16.0, 18.0]]]], "TUT0101": ["", "", "", [["GB404", ["W", 14.0, 15.0]]]], "PRA0102": ["", "", "", [["MB123", ["W", 10.0, 12.0]]]], "TUT0102": ["", "", "", [["GB304", ["F", 9.0, 10.0]]]], "LEC0101": ["", "", "Aleman, Dionne", [["SF1101", ["F", 15.0, 16.0]]]]}, "TUT": 1.0, "code": "MIE262H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#MAT186H1\">MAT186H1</a>, <a href=\"Course_Descriptions.html#MAT188H1\">MAT188H1</a>", "name": "Operations Research I: Deterministic OR"}, "ENV346H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>Various earth systems for energy transformation, storage and transport are explored. Geological, hydrological, biological, cosmological and oceanographic energy systems are considered in the context of the Earth as a dynamic system, including the variation of solar energy received by the planet and the redistribution of this energy through various radiative, latent and sensible heat transfer mechanisms. It considers the energy redistribution role of large-scale atmospheric systems, of warm and cold ocean currents, the role of the polar regions, and the functioning of various hydrological systems. The contribution and influence of tectonic systems on the surface systems is briefly introduced, as well the important role of energy storage processes in physical and biological systems, including the accumulation of fossil fuel reserves.</p><br>", "fallsections": {"LEC0101": ["", "", "", [["MC102", ["M", 10.0, 12.0]]]]}, "TUT": 3.0, "code": "ENV346H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "Prerequisite": "MAT135Y1/<a href=\"Course_Descriptions.html#MAT137Y1\">MAT137Y1</a>/<a href=\"Course_Descriptions.html#JMB170Y1\">JMB170Y1</a>;<a href=\"Course_Descriptions.html#BIO120H1\">BIO120H1</a>/BIO150Y1/<a href=\"Course_Descriptions.html#CHM138H1\">CHM138H1</a>/ <a href=\"Course_Descriptions.html#CHM139H1\">CHM139H1</a>/<a href=\"Course_Descriptions.html#CHM151Y1\">CHM151Y1</a>/PHY138Y1/PHY140Y1/<a href=\"Course_Descriptions.html#PHY131H1\">PHY131H1</a>/<a href=\"Course_Descriptions.html#PHY132H1\">PHY132H1</a>/<a href=\"Course_Descriptions.html#PHY151H1\">PHY151H1</a>/<a href=\"Course_Descriptions.html#PHY152H1\">PHY152H1</a>", "name": "Terrestrial Energy Systems"}, "ECE419H1": {"LEC": 3.0, "PRA": 1.5, "description": "<p>Design issues in distributed systems: heterogeneity, security, transparency, concurrency, fault-tolerance; networking principles; request-reply protocol; remote procedure calls; distributed objects; middleware architectures; CORBA; security and authentication protocols; distributed file systems; name services; global states in distributed systems; coordination and agreement; transactions and concurrency control; distributed transactions; replication.</p><br>", "TUT": 1.0, "code": "ECE419H1", "wintersections": {"PRA0101": ["", "", "", [["GB243", ["W", 12.0, 15.0]]]], "PRA0103": ["", "", "", [["GB243", ["R", 12.0, 15.0]]]], "PRA0102": ["", "", "", [["GB243", ["W", 12.0, 15.0]]]], "LEC0101": ["", "", "Amza, Cristiana", [["MC254", ["R", 17.0, 18.0]]]], "TUT0101": ["", "", "", [["GB412", ["F", 13.0, 14.0]]]], "TUT0102": ["", "", "", [["GB404", ["F", 14.0, 15.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#ECE344H1\">ECE344H1</a> or <a href=\"Course_Descriptions.html#ECE353H1\">ECE353H1</a>", "name": "Distributed Systems"}, "ECE527H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>Introductiontophotonic devices and components useful in a wide range of applicationsfrom bio-sensors to optical communications.Fundamentals in the operation and design of the devices will be covered.Topicsinclude: electromagnetic waves; birefringence and polarization; periodic structures and thin films; optical waveguides;interferometers and resonators; couplers and splitters; amplifiers and lasers; photonic intergration; nano-photonics.</p><br>", "fallsections": {"TUT0101": ["", "", "", [["HA410", ["F", 15.0, 17.0]]]], "LEC0101": ["", "", "Mojahedi, Mohammad", [["BAB024", ["W", 12.0, 13.0]]]]}, "TUT": 2.0, "code": "ECE527H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#ECE318H1\">ECE318H1</a> or <a href=\"Course_Descriptions.html#ECE320H1\">ECE320H1</a> or <a href=\"Course_Descriptions.html#ECE357H1\">ECE357H1</a>", "name": "Photonic Devices"}, "MSE490H1": {"LEC": 2.0, "PRA": 0.0, "description": "<p>The various roles of a practicing engineer in industry and society will be presented through a series of seminars. The lecturers will include practicing engineers from local companies and consulting firms and representatives from professional and technical societies.</p><br>", "fallsections": {"LEC0101": ["", "", "Baghbanan, Mohammadreza", [["MC252", ["F", 12.0, 14.0]]]]}, "TUT": 0.0, "code": "MSE490H1", "SC": ["F"], "CR": 0.25, "SEM": 0, "name": "Professional Ethics and Practice"}, "CHE467H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>Core Course in the Environmental Engineering Minor A course which treats environmental engineering from a broad based but quantitative perspective and covers the driving forces for engineering activities as well as engineering principles. Models which are used for environmental impact, risk analysis, health impact, pollutant dispersion, and energy system analysis are covered.</p><br>", "fallsections": {"TUT0101": ["", "", "", [["BA1230", ["W", 11.0, 12.0]]]], "LEC0101": ["", "", "Kirk, Donald", [["WB219", ["R", 9.0, 11.0]]]]}, "TUT": 1.0, "code": "CHE467H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "name": "Environmental Engineering"}, "ECE454H1": {"LEC": 3.0, "PRA": 3.0, "description": "<p>Fundamentaltechniques for programming computer systems, with an emphasis on obtaining good performance. Topics covered include: how to measure and understand program and execution and behaviour, how to get the most out of an optimizing compiler, how memory is allocated and managed, and how to exploit caches and the memory hierarchy.Furthermore, current trends in multicore, multithreaded and data parallel hardware, and how to exploit parallelism in their programs will be covered.</p><br>", "fallsections": {"PRA0101": ["", "", "", [["GB243", ["R", 12.0, 15.0]]]], "PRA0102": ["", "", "", [["GB251", ["R", 15.0, 18.0]]]], "LEC0102": ["", "", "Amza, Cristiana", [["GB303", ["F", 10.0, 11.0]]]], "LEC0101": ["", "", "Yuan, Ding", [["RS208", ["W", 10.0, 11.0]]]]}, "TUT": 0.0, "code": "ECE454H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "name": "Computer Systems Programming"}, "AER372H1": {"LEC": 3.0, "PRA": 1.5, "description": "<p>An introduction to dynamic systems and control. Models of physical systems. Stability and feedback control theory. Analysis and synthesis of linear feedback systems by classical and state space techniques. Introduction to nonlinear and optimal control systems. Digital computer control. Multivariable feedback system design.</p><br>", "TUT": 1.0, "Recommended Preparation": "<a href=\"Course_Descriptions.html#MAT185H1\">MAT185H1</a>, <a href=\"Course_Descriptions.html#MAT292H1\">MAT292H1</a>", "code": "AER372H1", "wintersections": {"PRA0101": ["", "", "", [["MC402", ["M", 15.0, 18.0]]]], "TUT0101": ["", "", "", [["GB221", ["R", 18.0, 19.0]]]], "PRA0102": ["", "", "", [["BA3114", ["M", 15.0, 18.0]]]], "LEC0101": ["", "", "Schoellig, Angela", [["GB221", ["R", 17.0, 18.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "name": "Control Systems"}, "MSE354H1": {"LEC": 2.0, "PRA": 0.0, "description": "<p>Materials processing factors in manufacturing processes such as casting, mechanical forming, powder forming, joining and surface treatment (sprayed coatings, diffusion bonding, ion implantation etc). Materials strengthening in manufacturing.  Thermo and mechanical processing.  Selected case studies.</p><br>", "TUT": 1.0, "code": "MSE354H1", "wintersections": {"TUT0101": ["", "", "", [["GB412", ["T", 14.0, 15.0]]]], "LEC0101": ["", "", "Ramsay, Scott", [["WB219", ["F", 13.0, 14.0]]]]}, "SC": ["S"], "CR": 0.25, "SEM": 0, "name": "Materials in Manufacturing"}, "ECE417H1": {"LEC": 3.0, "PRA": 1.5, "description": "<p>Basic concepts of digital communication. Baseband data transmission, intersymbol interference, Nyquist pulse shaping, equalization, line coding, multi-path fading, diversity. Binary and M-ary modulation schemes, synchronization. Signal space concepts, optimum receivers, coherent and noncoherent detectors. Information theory, source encoding, error control coding, block and convolutional codes.</p><br>", "TUT": 1.0, "code": "ECE417H1", "wintersections": {"PRA0101": ["", "", "", [["SF2201", ["F", 15.0, 18.0]]]], "TUT0101": ["", "", "", [["BA3116", ["T", 13.0, 14.0]]]], "PRA0102": ["", "", "", [["SF2201", ["F", 15.0, 18.0]]]], "TUT0102": ["", "", "", [["WB144", ["R", 12.0, 13.0]]]], "LEC0101": ["", "", "Kschischang, Frank", [["BA1200", ["W", 17.0, 18.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#ECE302H1\">ECE302H1</a> and <a href=\"Course_Descriptions.html#ECE316H1\">ECE316H1</a>, or <a href=\"Course_Descriptions.html#STA286H1\">STA286H1</a>", "name": "Digital Communication"}, "STA347H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>An overview of probability from a non-measure theoretic point of view. Random variables/vectors; independence, conditional expectation/probability and consequences. Various types of convergence leading to proofs of the major theorems in basic probability. An introduction to simple stochastic processes such as Poisson and branching processes.</p><br>", "fallsections": {"LEC2001": ["", "", "", [["ES1050", ["R", 18.0, 21.0]]]]}, "TUT": 0.0, "code": "STA347H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#STA247H1\">STA247H1</a>/<a href=\"Course_Descriptions.html#STA255H1\">STA255H1</a>/<a href=\"Course_Descriptions.html#STA257H1\">STA257H1</a>/ECO227; <a href=\"Course_Descriptions.html#MAT223H1\">MAT223H1</a>/<a href=\"Course_Descriptions.html#MAT240H1\">MAT240H1</a>; <a href=\"Course_Descriptions.html#MAT235Y1\">MAT235Y1</a>/<a href=\"Course_Descriptions.html#MAT237Y1\">MAT237Y1</a>/<a href=\"Course_Descriptions.html#MAT257Y1\">MAT257Y1</a> (Note: <a href=\"Course_Descriptions.html#STA257H1\">STA257H1</a> and <a href=\"Course_Descriptions.html#MAT237Y1\">MAT237Y1</a>/<a href=\"Course_Descriptions.html#MAT257Y1\">MAT257Y1</a>; (<a href=\"Course_Descriptions.html#MAT223H1\">MAT223H1</a>, <a href=\"Course_Descriptions.html#MAT224H1\">MAT224H1</a>)/<a href=\"Course_Descriptions.html#MAT240H1\">MAT240H1</a> are very strongly recommended)", "name": "Probability"}, "CSC443H1": {"LEC": 2.0, "PRA": 0.0, "description": "<p>Implementation of database management systems. Storage management, indexing, query processing, concurrency control, transaction management. Database systems on parallel and distributed architectures. Modern database applications: data mining, data warehousing, OLAP, data on the web. Object-oriented and object-relational databases.</p><br>", "TUT": 1.0, "code": "CSC443H1", "wintersections": {"LEC2001": ["", "", "", [["", ["T", 15.0, 18.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#CSC343H1\">CSC343H1</a>, <a href=\"Course_Descriptions.html#CSC369H1\">CSC369H1</a>, <a href=\"Course_Descriptions.html#CSC373H1\">CSC373H1</a>/<a href=\"Course_Descriptions.html#CSC375H1\">CSC375H1</a>", "name": "Database System Technology"}, "CHE223H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>Analysis of data using statistics and design of experiments. Topics include probability, properties of the normal distribution, confidence intervals, hypothesis testing, fitting equations to data, analysis of variance and design of experiments. The tutorial involves, in part, the application of commercial software to interpret experimental data, as obtained in Chemical Engineering laboratories.</p><br>", "TUT": 1.0, "code": "CHE223H1", "wintersections": {"TUT0101": ["", "", "McGuigan, Alison", [["HA403", ["R", 11.0, 12.0]]]], "TUT0102": ["", "", "McGuigan, Alison", [["SF3202", ["W", 14.0, 15.0]]]], "LEC0101": ["", "", "McGuigan, Alison", [["SF1101", ["F", 11.0, 12.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#MAT186H1\">MAT186H1</a>, <a href=\"Course_Descriptions.html#MAT187H1\">MAT187H1</a>", "name": "Statistics"}, "PHY427H1": {"LEC": 0.0, "PRA": 6.0, "description": "<p>Experiments in this course are designed to form a bridge to current experimental research. A wide range of experiments are available using contemporary techniques and equipment. In addition to the standard set of experiments, a limited number of research projects may be available. This laboratory is a continuation of PHY327.</p><br>", "fallsections": {"PRA0101": ["", "", "Bailey, David and Krasnopolskaia, Natalia and van Driel, Henry and Wei, John and Clark, Kenneth and Morris, Stephen and Netterfield, Barth", [["MP251", ["F", 10.0, 13.0]]]]}, "TUT": 0.0, "code": "PHY427H1", "SC": ["F", "S"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#PHY327H1\">PHY327H1</a>", "name": "Advanced Physics Laboratory"}, "CHE222H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>Solution of differential equations using the D-operator, Laplace transform methods and vector-matrix techniques. Application of these techniques to problems of chemical engineering interest. Considerable emphasis will be placed on the formulation of the relevant differential equations and the identification of the appropriate boundary conditions.</p><br>", "TUT": 2.0, "code": "CHE222H1", "wintersections": {"TUT0101": ["", "", "", [["HA403", ["R", 14.0, 15.0]]]], "TUT0102": ["", "", "", [["HA403", ["W", 12.0, 13.0]]]], "LEC0101": ["", "", "Mahadevan, Radhakrishnan", [["MP102", ["T", 13.0, 14.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#MAT186H1\">MAT186H1</a>, <a href=\"Course_Descriptions.html#MAT187H1\">MAT187H1</a>", "name": "Applied Differential Equations"}, "ECE442H1": {"LEC": 3.0, "PRA": 2.0, "description": "<p>An introduction to the fundamentals of micro- and nano-fabrication processes with emphasis on cleanroom practices. The physical principles of optical lithography, electron-beam lithography, alternative nanolithography techniques, and thin film deposition and metrology methods. The physical and chemical processes of wet and dry etching. Cleanroom concepts and safety protocols. Sequential micro-fabrication processes involved in the manufacture of microelectronic and photonic devices. Imaging and characterization of micro- and nano-structures. Examples of practical existing and emerging micro- and nano-devices. Limited enrollment.</p><br>", "fallsections": {"PRA0101": ["", "", "", [["PT464", ["W", 14.0, 18.0]]]], "PRA0103": ["", "", "", [["PT464", ["M", 11.0, 15.0]]]], "PRA0102": ["", "", "", [["PT464", ["W", 14.0, 18.0]]]], "PRA0104": ["", "", "", [["PT464", ["M", 11.0, 15.0]]]], "LEC0101": ["", "", "Kosteski, Tome", [["RS310", ["T", 11.0, 12.0]]]], "TUT0101": ["", "", "", [["BA3012", ["W", 12.0, 13.0]]]]}, "TUT": 1.0, "code": "ECE442H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#ECE335H1\">ECE335H1</a> or <a href=\"Course_Descriptions.html#ECE350H1\">ECE350H1</a>", "name": "Introduction to Micro- and Nano-Fabrication Technologies"}, "CIV382Y1": {"LEC": 0.0, "PRA": 0.0, "description": "<p>Students will assemble a portfolio of communication assignments drawn from their second and third year Civil Engineering courses as a showcase of their ability to meet the graduate attributes for communication. The student will demonstrate competence in discipline specific written, oral, and visual communication through the selection of assignments for the portfolio. Each entry will be framed by a short introduction speaking to the context of the work and its significance in the portfolio. Students whose communication work is not up to standard will be provided with opportunities for revision. The course will be offered on a credit/no credit basis; students who receive no credit must retake the course in year 4.</p><br>", "fallsections": {"TUT0101": ["", "", "Chong, Alan", [["SF1101", ["M", 19.0, 20.0]]]]}, "TUT": 0.25, "code": "CIV382Y1", "SC": ["Y"], "CR": 0.0, "SEM": 0, "name": "Civil Engineering Communication Portfolio"}, "PHY335H1": {"LEC": 2.0, "PRA": 0.0, "description": "<p>Review of elementary quantum mechanics, (photo-electric and Compton effects, Bohr model, de Broglie waves); some bound (harmonic oscillator, hydrogen atom) and unbound (potential barriers) solutions of the Schrodiner equation; probability interpretation; operators and the theory of measurement; expectation values and uncertainties; angular momentum (orbital and spin); magnetic resonance as an application.</p><br>", "TUT": 1.0, "name": "Introduction to Quantum Mechanics", "code": "PHY335H1", "wintersections": {"TUT0101": ["", "", "", [["GB404", ["F", 13.0, 14.0]]]], "LEC0101": ["", "", "Wong, Willy", [["RS208", ["R", 16.0, 17.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "Exclusion": "<a href=\"Course_Descriptions.html#MSE235H1\">MSE235H1</a>"}, "ECE469H1": {"LEC": 3.0, "PRA": 1.5, "description": "<p>This course provides an introduction to optical communication systems and networks at the system and functional level. Applications range from telecommunication networks (short to long haul) to computing networks (chip-to-chip, on chip communications, optical backplanes). Basic principles of optical transmission and associated components used for transmission of light and optical networks; system design tools for optical links; multi-service system requirements; optical network design tools (routing and wavelength assignment), network management and survivability.</p><br>", "TUT": 1.0, "name": "Optical Communications and Networks", "code": "ECE469H1", "wintersections": {"PRA0103": ["", "", "", [["SF2112", ["T", 12.0, 15.0]]]], "PRA0102": ["", "", "", [["SF2112", ["M", 12.0, 15.0]]]], "PRA0105": ["", "", "", [["SF2112", ["R", 15.0, 18.0]]]], "PRA0104": ["", "", "", [["SF2112", ["T", 12.0, 15.0]]]], "LEC0101": ["", "", "Poon, Joyce", [["GB119", ["M", 15.0, 16.0]]]], "TUT0101": ["", "", "", [["HA401", ["F", 12.0, 13.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "Exclusion": "ECE425H1 or ECE467H1"}, "ECE334H1": {"LEC": 3.0, "PRA": 1.5, "description": "<p>Digital design techniques for integrated circuits. The emphasis will be on the design of logic gates at the transistor level. A number of different logic families will be described, but CMOS will be emphasized. Review of: device modeling, IC processing, and Spice simulation, simplified layout rules, inverter noise margins, transient response, and power dissipation, traditional CMOS logic design, transmission gates, RC timing approximations, input-output circuits, latches and flipflops, counters and adders, decoders and muxes, dynamic gates, SRAMs, DRAMs, and EEPROMs.</p><br>", "fallsections": {"PRA0101": ["", "", "", [["GB243", ["W", 15.0, 18.0]]]], "PRA0103": ["", "", "", [["GB243", ["M", 15.0, 18.0]]]], "PRA0102": ["", "", "", [["GB243", ["W", 15.0, 18.0]]]], "LEC0102": ["", "", "Phang, Khoman", [["GB120", ["F", 15.0, 16.0]]]], "PRA0104": ["", "", "", [["GB243", ["M", 15.0, 18.0]]]], "LEC0101": ["", "", "Phang, Khoman", [["BA1220", ["T", 13.0, 14.0]]]], "TUT0101": ["", "", "", [["BA2195", ["R", 14.0, 15.0]]]], "TUT0103": ["", "", "", [["BA2185", ["R", 14.0, 15.0]]]], "TUT0102": ["", "", "", [["BA2175", ["T", 16.0, 17.0]]]], "TUT0104": ["", "", "", [["BA2165", ["R", 17.0, 18.0]]]]}, "TUT": 1.0, "code": "ECE334H1", "SC": ["F", "S"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#ECE241H1\">ECE241H1</a>  and <a href=\"Course_Descriptions.html#ECE231H1\">ECE231H1</a>  or <a href=\"Course_Descriptions.html#ECE253H1\">ECE253H1</a>  and <a href=\"Course_Descriptions.html#ECE360H1\">ECE360H1</a>", "name": "Digital Electronics"}, "CHE341H1": {"LEC": 3.0, "PRA": 0.0, "description": "This course advances the understanding of the use of materials in engineering design, with special emphasis on corrosion and the effect of chemical environment on long term failure modes.  Students will learn how to apply material property data to specify materials for load bearing applications, thermal and other non-structural applications, and chemical containment and transport.  Topics will include strength of materials concepts, an introduction to computerized materials databases, material failure modes and criteria, principles of corrosion, and practical applications of corrosion prediction and mitigation.  Students are required to design a component of their choice and do a detailed materials selection as a major design project.<br>\n<br>\n", "fallsections": {"TUT0101": ["", "", "", [["RS208", ["W", 16.0, 17.0]]]], "TUT0102": ["", "", "", [["SF2202", ["M", 11.0, 12.0]]]], "LEC0101": ["", "", "Newman, Roger Charles and McGuigan, Alison", [["SF1101", ["W", 15.0, 16.0]]]]}, "TUT": 1.0, "code": "CHE341H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "name": "Engineering Materials"}, "CIV488H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>A complete introduction to small business formation, management and wealth creation. Topics include: the nature of the Entrepreneur and the Canadian business environment; business idea search and Business Plan construction; Buying a business, franchising, taking over a family business; Market research and sources of data; Marketing strategies promotion, pricing, advertising, electronic channels and costing; The sales process and management, distribution channels and global marketing; Accounting, financing and analysis, sources of funding, and financial controls; The people dimension: management styles, recruiting and hiring, legal issues in employment and Human Resources; Legal forms of organization and business formation, taxation, intellectual property protection; the e-Business world and how businesses participate; Managing the business: location and equipping the business, suppliers and purchasing, credit, ethical dealing; Exiting the business and succession, selling out. A full Business Plan will be developed by each student and the top submissions will be entered into a Business Plan competition with significant cash prices for the winners. Examples will be drawn from real business situations including practicing entrepreneurs making presentations and class visits during the term. (Identical courses are offered in other Departments: <a href=\"Course_Descriptions.html#MSE488H1\">MSE488H1</a>, <a href=\"Course_Descriptions.html#MIE488H1\">MIE488H1</a>, <a href=\"Course_Descriptions.html#ECE488H1\">ECE488H1</a> and <a href=\"Course_Descriptions.html#CHE488H1\">CHE488H1</a>.)</p><br>", "TUT": 2.0, "name": "Entrepreneurship and Business for Engineers", "code": "CIV488H1", "wintersections": {"TUT0101": ["", "", "", [["GB248", ["T", 12.0, 14.0]]]], "LEC0101": ["", "", "Paradi, Joseph and Orozco, Joseph and Paradi, Judy", [["WB119", ["M", 18.0, 21.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "Exclusion": "<a href=\"Course_Descriptions.html#APS234H1\">APS234H1</a>, <a href=\"Course_Descriptions.html#APS432H1\">APS432H1</a>."}, "MIE439H1": {"LEC": 3.0, "PRA": 2.0, "description": "<p>Introduction to the application of the principles of mechanical engineering - principally solid mechanics, fluid mechanics, and dynamics - to living systems. Topics include cellular mechanics, blood rheology, circulatory mechanics, respiratory mechanics, skeletal mechanics, and locomotion. Applications of these topics to biomimetic and biomechanical design are emphasized through a major, integrative group project.</p><br>", "TUT": 0.0, "code": "MIE439H1", "wintersections": {"PRA0101": ["", "", "", [["BA2145", ["T", 10.0, 12.0]]]], "LEC0101": ["", "", "Simmons, Craig", [["GB221", ["F", 13.0, 14.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "name": "Biomechanics I"}, "ECE110H1": {"LEC": 3.0, "PRA": 1.0, "description": "<p>Anoverview of the physics of electricity and magnetism: Coulombs law, Gauss law, Amperes law, Faradays law.Physics of capacitors, resistors and inductors.An introduction to circuit analysis: resistive circuits, nodal and mesh analysis, 1st orderRC and RL transient response andsinusoidal steady-state analysis.</p>\r\n<p></p><br>", "TUT": 2.0, "code": "ECE110H1", "wintersections": {"TUT0107": ["", "", "", [["BA1200", ["F", 16.0, 18.0]]]], "TUT0106": ["", "", "", [["WB342", ["W", 12.0, 14.0]]]], "TUT0101": ["", "", "", [["GB405", ["M", 13.0, 15.0]]]], "TUT0103": ["", "", "", [["WB342", ["F", 13.0, 15.0]]]], "TUT0102": ["", "", "", [["BA1210", ["F", 16.0, 18.0]]]], "PRA0112": ["", "", "", [["GB341", ["F", 16.0, 18.0]]]], "TUT0104": ["", "", "", [["GB304", ["R", 13.0, 15.0]]]], "PRA0110": ["", "", "", [["GB341", ["R", 12.0, 14.0]]]], "PRA0111": ["", "", "", [["GB341", ["F", 16.0, 18.0]]]], "TUT0109": ["", "", "", [["RS208", ["F", 16.0, 18.0]]]], "TUT0108": ["", "", "", [["WB342", ["M", 15.0, 17.0]]]], "LEC0106": ["", "", "Aitchison, J. Stewart", [["BA1170", ["T", 10.0, 11.0]]]], "LEC0104": ["", "", "Helmy, Amr", [["MC254", ["R", 15.0, 16.0]]]], "LEC0105": ["", "", "Yoo, Paul", [["GB120", ["T", 10.0, 11.0]]]], "LEC0102": ["", "", "Wang, Belinda", [["MS2172", ["F", 15.0, 16.0]]]], "LEC0103": ["", "", "Bardakjian, Berj", [["BA1180", ["F", 15.0, 16.0]]]], "LEC0101": ["", "", "Mojahedi, Mohammad", [["SS2102", ["R", 14.0, 15.0]]]], "TUT0112": ["", "", "", [["WB342", ["W", 16.0, 18.0]]]], "TUT0110": ["", "", "", [["SF2202", ["W", 16.0, 18.0]]]], "TUT0111": ["", "", "", [["SF3201", ["R", 10.0, 12.0]]]], "PRA0109": ["", "", "", [["GB341", ["R", 12.0, 14.0]]]], "PRA0108": ["", "", "", [["GB341", ["R", 16.0, 18.0]]]], "PRA0101": ["", "", "", [["GB341", ["W", 12.0, 14.0]]]], "PRA0103": ["", "", "", [["GB341", ["W", 16.0, 18.0]]]], "PRA0102": ["", "", "", [["GB341", ["W", 12.0, 14.0]]]], "PRA0105": ["", "", "", [["GB341", ["M", 13.0, 15.0]]]], "PRA0104": ["", "", "", [["GB341", ["W", 16.0, 18.0]]]], "PRA0107": ["", "", "", [["GB341", ["R", 16.0, 18.0]]]], "PRA0106": ["", "", "", [["GB341", ["M", 13.0, 15.0]]]], "TUT0105": ["", "", "", [["GB304", ["W", 12.0, 14.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "name": "Electrical Fundamentals"}, "MSE217H1": {"LEC": 3.0, "PRA": 0.0, "description": "The diffusion mechanisms in solids, liquids and gases are reviewed.  The effects of imperfections in solids on diffusion rates are discussed.  Topics include diffusion coefficient, Fick’s law, steady state and unsteady state diffusion.  The course covers factors affecting the rate at which chemical reactions take place.  The effects that temperature, concentration, pressure and catalysts have on reaction rates are discussed.  Topics such as homogeneous versus heterogeneous reactions, order or reaction, and activation energy are also covered.<br>\n<br>\n", "TUT": 2.0, "code": "MSE217H1", "wintersections": {"TUT0101": ["", "", "", [["HA403", ["T", 10.0, 12.0]]]], "LEC0101": ["", "", "Baghbanan, Mohammadreza", [["BA1220", ["F", 9.0, 11.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "name": "Diffusion and Kinetics"}, "PHY487H1": {"LEC": 2.0, "PRA": 0.0, "description": "<p>Introduction to the concepts used in the modern treatment of solids. The student is assumed to be familiar with elementary quantum mechanics. Topics include: crystal structure, the reciprocal lattice, crystal binding, the free electron model, electrons in periodic potential, lattice vibrations, electrons and holes, semiconductors, metals.</p><br>", "fallsections": {"LEC0101": ["", "", "", [["MP134", ["R", 14.0, 15.0]]]]}, "TUT": 0.0, "code": "PHY487H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "name": "Condensed Matter Physics"}, "ECE464H1": {"LEC": 3.0, "PRA": 1.5, "description": "<p>The radio medium, radio communication system examples. Link budget: cable losses, propagation loss, antenna gains. Basic concepts of propagation: path loss, multi-path propagation and fading. Raleigh and Rician fading models, Doppler shift, delay spread, coherence time and coherence bandwidth of the channel. Analog modulation schemes and their bandwidths. Digital modulation schemes and their bandwidths and bit rates: BPSK, QPSK, MSK, GMSK. Basic concepts of speech coding. Error correction coding, interleaving, and multiple access frame structure. The physical layer description of the AMPS, IS-54, and GSM cellular systems. The cellular concept: frequency re-use, re-use cluster concept. Channel allocation. Cellular system architecture for AMPS, IS-54, and GSM. Hand-offs and transmitter power control. Cellular traffic, call blocking, concept of Erlangs. Basic ideas in spread spectrum modulation, spreading codes, bit error probability. Orthogonal and non-orthogonal CDMA Basic concepts in CDMA networks.</p><br>", "TUT": 1.0, "code": "ECE464H1", "wintersections": {"PRA0101": ["", "", "", [["SF2201", ["W", 12.0, 15.0]]]], "TUT0101": ["", "", "", [["WB144", ["R", 15.0, 16.0]]]], "PRA0102": ["", "", "", [["SF2201", ["W", 12.0, 15.0]]]], "TUT0102": ["", "", "", [["WB144", ["F", 13.0, 14.0]]]], "LEC0101": ["", "", "Maljevic, Ivo", [["RS310", ["M", 18.0, 20.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#ECE302H1\">ECE302H1</a> and <a href=\"Course_Descriptions.html#ECE316H1\">ECE316H1</a>, or <a href=\"Course_Descriptions.html#STA286H1\">STA286H1</a>", "name": "Wireless Communication"}, "APS320H1": {"LEC": 2.0, "PRA": 0.0, "description": "<p><strong></strong>An examination of representations of science/scientists in theatre. Reading and/or viewing of works by contemporary playwrights and related materials on science and culture. Critical essays; in-class discussion and scene study.</p><br>", "fallsections": {"TUT0101": ["", "", "", [["BA2139", ["M", 18.0, 20.0]]]], "LEC0101": ["", "", "Tihanyi, Deborah and Wilkinson, Lydia", [["BA2159", ["T", 18.0, 20.0]]]]}, "TUT": 2.0, "code": "APS320H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "name": "Representing Science on Stage"}, "FOR421H1": {"LEC": 2.0, "PRA": 0.0, "description": "<p>With over 80% of the world's population now living in cities, tomorrow's forests will be urban. Increasing global recognition of nature deficit disorder and the values of green infrastructure to mitigate broader human impacts gives a new meaning to the term 'urban forestry', coined here at UofT and now recognized widely. Trees in and around the city are key to providing multiple engineered and ecological services that only recently have been brought into the responsible fiscal planning of every municipality around the globe. If managed properly (a key concept), urban forests mitigate climate change and urban heat island effects, act as carbon sinks, air filters, water purifiers, air conditioners, noise dampeners, wildlife and/or biodiversity refuges, and green spaces for the human spirit. Here, we explore the challenges and opportunities of this exciting new applied field at the cross-roads of ecology, engineering and planning to ensure future global sustainability.</p><br>", "fallsections": {"LEC0101": ["", "", "Smith, Sandy", [["WB342", ["R", 17.0, 19.0]]]]}, "TUT": 0.0, "code": "FOR421H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "name": "Green Urban Infrastructure: Sustainable City Forests"}, "APS162H1": {"LEC": 0.0, "PRA": 0.0, "description": "<p>This online-only course focuses on the fundamental tools of calculus and its connections to engineering. The topics include limits, differentiation, graphing, optimization problems, and definite and indefinite integrals. Problems combining calculus with geometry, linear algebra, statics, and mechanics will be examined.</p><br>", "TUT": 0.0, "name": "Calculus for Engineers I", "code": "APS162H1", "SC": ["F", "S"], "CR": 0.5, "SEM": 0, "Available Online": "consult Faculty or Graduate Unit for details", "Exclusion": "<a href=\"Course_Descriptions.html#MAT186H1\">MAT186H1</a>/<a href=\"Course_Descriptions.html#MAT196H1\">MAT196H1</a>"}, "PHY493H1": {"LEC": 2.0, "PRA": 0.0, "description": "<p>Why do earthquakes occur and how are they related to tectonic motion of the earth's surface? What is the physics behind the propagation of seismic waves through the earth, and how can it be used to determine the internal structures of the earth? This introductory course is aimed at understanding the physics behind seismic wave propagation, as well as asymptotic and numerical solutions to the elastodynamic equation. Traveltime and amplitude of seismic waves are discussed based on seismic ray theory, while numerical methods are introduced to obtain accurate solutions to more complex velocity structures. Seismic tomographic methods, including their applications to hydrocarbon reservoir imaging, are also covered.</p><br>", "TUT": 0.0, "Recommended Preparation": "<a href=\"Course_Descriptions.html#PHY395H1\">PHY395H1</a>", "code": "PHY493H1", "wintersections": {"LEC0101": ["", "", "", [["", ["F", 15.0, 16.0]]]]}, "SC": ["F"], "CR": 0.5, "SEM": 0, "name": "Seismology"}, "APS321H1": {"LEC": 2.0, "PRA": 0.0, "description": "<p><strong></strong>Analytical approach to writing and style; representations of current scientific research and developments in technology in the popular media; books by scientists aimed at non technical readers, reporting (including new media) on developments in science and technology. Rhetorical strategies for delivering technical information to non technical readers, inlcuding misrepresentations, analogy and metaphor. Focus on the popular medias (mis)representations of climate science, nanotechnology, and bioengineering.</p><br>", "TUT": 2.0, "code": "APS321H1", "wintersections": {"TUT0101": ["", "", "", [["BA2135", ["W", 17.0, 19.0]]]], "LEC0101": ["", "", "Chong, Alan", [["BA2135", ["M", 17.0, 19.0]]]]}, "SC": ["F"], "CR": 0.5, "SEM": 0, "Prerequisite": "CHE397H1/<a href=\"Course_Descriptions.html#ECE297H1\">ECE297H1</a>/ECE299H1/ESC201H1/<a href=\"Course_Descriptions.html#MSE390H1\">MSE390H1</a>", "name": "Representing Science and Technology in Popular Media"}, "CHE213H1": {"LEC": 3.0, "PRA": 0.0, "description": "Topics include the structure, bonding and characteristic reactions of organic compounds including additions, eliminations, oxidations, reductions, radical reactions, condensation/hydrolysis and rearrangements.  The chemical relationships and reactivities of simple functional groups are discussed with an emphasis placed on reaction mechanisms involving the formation of organic intermediates, chemicals and polymers.  An introduction will be given on biologically relevant compounds such as carbohydrates, proteins, lipids and nucleic acids.  Examples will be discussed which outline the usefulness of these reactions and chemicals within the broader chemical industry.<br>Corequisite:\n                    <a href=\"Course_Descriptions.html#CHE204H1\">CHE204H1</a>Y<br>\n<br>\n", "TUT": 1.0, "code": "CHE213H1", "wintersections": {"TUT0101": ["", "", "", [["SF3202", ["M", 12.0, 13.0]]]], "TUT0102": ["", "", "", [["HA403", ["W", 15.0, 16.0]]]], "LEC0101": ["", "", "Edwards, Elizabeth", [["SF1105", ["F", 9.0, 11.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "name": "Applied Chemistry II - Organic Chemistry"}, "APS310H0": {"LEC": 3.0, "PRA": 1.0, "description": "<p>The future of energy systems in India and Canada. A spectrum of current and emerging technologies used in providing energy and in its end use, including but not limited to electricity generation and transportation systems, are compared and contrasted re their applicability and barriers. Energy issues and challenges across the two countries; the role of energy in economic growth and in reducing poverty. Multi-variable analytic approach: technical aspects of the energy systems at an intermediate level of depth, but also economic analysis, environmental and sustainability issues, and social benefits. Case study examples of organizations bringing these technologies into use. India and Canada respectively in a global energy context relative to China, the U.S. and the Middle Eastern countries. Developing a framework for broader assessment of the context of engineering work  how engineering solutions and practices vary depending on the setting where the solutions are used. Possible collaborations between India and Canada, and between universities in the two countries, are explored.</p>\r\n<p>Offered through Summer Abroad Program. Duration of the course will be two to three calendar weeks, comprising approximately 42 hours of classroom instruction (up to 7 hours per day) and at least 3 field trips totaling 10 hours of instruction time. Total of 52 hours of instruction scheduled over 2-3 weeks.</p><br>", "TUT": 0.0, "name": "Defining Energy Futures in India and Canada", "code": "APS310H0", "SC": ["F"], "CR": 0.5, "SEM": 0, "Exclusion": "<a href=\"Course_Descriptions.html#APS510H1\">APS510H1</a>"}, "MIE263H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>Modeling and analysis of systems subject to uncertainty using probabilistic methods. Introduction to decision analysis. Derivation and application of Bernoulli and Poisson processes, Markov chains, and queuing models. Stochastic optimization and extensions. Applications to engineering, games of chance, health care, and management.</p><br>", "TUT": 2.0, "code": "MIE263H1", "wintersections": {"TUT0101": ["", "", "", [["HA403", ["M", 15.0, 17.0]]]], "TUT0102": ["", "", "", [["GB304", ["M", 15.0, 17.0]]]], "LEC0101": ["", "", "Terekhov, Daria", [["BA1190", ["W", 10.0, 12.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#MIE231H1\">MIE231H1</a> or <a href=\"Course_Descriptions.html#MIE236H1\">MIE236H1</a>", "name": "Operations Research II: Stochastic OR"}, "MSE550H1": {"LEC": 3.0, "PRA": 2.0, "description": "<p>This course deals with the physical properties of bulk nanostructured materials. Included are mechanical properties (elastic behavior, tensile and compressive strength, creep, wear and fatigue properties) electrical properties (electrical transport phenomena, electrical resistivity) magnetic properties (paramagnetic, diamagnetic, soft and hard ferromagnetic, superparamagnetic and antiferromagnetic properties), thermodynamic properties (interfacial enthalpy, thermal stability, phase transformations, heat capacity). The considerable differences observed for nanocrystalline solids compared to conventional polycrystalline and amorphous solids will be discussed in terms of the microstructural differences for these materials.</p><br>", "TUT": 1.0, "code": "MSE550H1", "wintersections": {"PRA0101": ["", "", "Grozea, Dan", [["WB255", ["F", 13.0, 15.0]]]], "TUT0101": ["", "", "", [["BA2175", ["T", 15.0, 16.0]]]], "LEC0101": ["", "", "Daly, Matthew", [["BA1230", ["M", 12.0, 13.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "name": "Advanced Physical Properties of Structural Nanomaterials"}, "FOR310H1": {"LEC": 2.0, "PRA": 0.0, "description": "<p>Socio-economic, technical, political and environmental issues associated with the utilization of forest biomass (e.g., harvesting residues, thinnings, salvage, short rotation woody crops) for a source of renewable energy.</p><br>", "TUT": 1.0, "Recommended Preparation": "Completion of at least 6 Science FCE’s", "code": "FOR310H1", "wintersections": {"LEC5101": ["", "", "", [["ES4001", ["T", 17.0, 19.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "name": "Bioenergy from Sustainable Forest Management"}, "CSC467H1": {"LEC": 3.0, "PRA": 1.5, "description": "<p>Compiler organization, compiler writing tools, use of regular expressions, finite automata and context-free grammars, scanning and parsing, runtime organization, semantic analysis, implementing the runtime model, storage allocation, code generation.</p><br>", "fallsections": {"PRA0101": ["", "", "", [["GB243", ["T", 15.0, 18.0]]]], "TUT0101": ["", "", "", [["BA2145", ["M", 16.0, 17.0]]]], "LEC0101": ["", "", "Zhu, Jianwen", [["BA1240", ["T", 12.0, 13.0]]]]}, "TUT": 1.0, "code": "CSC467H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#ECE352H1\">ECE352H1</a>", "name": "Compilers and Interpreters"}, "CIV357H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>Building on the \"Structural Design I\" course, further analysis tools for indeterminate structural systems are studied with generalized flexibility and stiffness methods. Loadings due to force, support displacement, temperature change and member prestrain are covered. Timber design aspects include material properties, beams, compression members and simple connections. The behaviour and design of basic reinforced concrete elements covers concrete properties and members under axial load, shear and bending. Other practical aspects of design incorporated are crack control, minimum and maximum reinforcement ratios, durability, formwork and shoring. The aptitude for structural analysis and concrete design is then tested in a low-rise, reinforced concrete building design project.</p><br>", "TUT": 2.0, "code": "CIV357H1", "wintersections": {"TUT0101": ["", "", "Gauvreau, Douglas Paul", [["WB144", ["R", 13.0, 15.0]]]], "LEC0101": ["", "", "Gauvreau, Douglas Paul", [["WB144", ["T", 12.0, 15.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#CIV352H1\">CIV352H1</a>", "name": "Structural Design 2"}, "CIV235H1": {"LEC": 0.0, "PRA": 6.0, "description": "<p>Fluency in graphical communication skills as part of the civil engineering design process is emphasized. Drawings are prepared making use of freehand sketching, drafting equipment and commercially available computer drafting programs. Topics in descriptive geometry are covered to develop spatial visualization skills. Drawing procedures and standards relevant to Civil Engineering projects to be covered include layout and development of multiple orthographic views, sectional views, dimensioning, and pictorial views. Class projects, assignments, and examples demonstrate how graphical skills fit into the overall design process.<br /></br><br /></br></p><br>", "TUT": 0.0, "code": "CIV235H1", "wintersections": {"PRA0101": ["", "", "Gauvreau, Douglas Paul", [["GB404", ["M", 16.0, 18.0]]]], "PRA0102": ["", "", "Gauvreau, Douglas Paul", [["GB405", ["M", 16.0, 18.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "name": "Civil Engineering Graphics"}, "CHM210H1": {"LEC": 2.0, "PRA": 0.0, "description": "<p>Examines the fundamental chemical processes of the Earths natural environment, and changes induced by human activity. Topics relate to the atmosphere: urban air pollution, stratospheric ozone depletion, acid rain; the hydrosphere: water resources and pollution, wastewater analysis; biogeochemistry and inorganic metals in the environment.</p><br>", "TUT": 1.0, "name": "Chemistry of Environmental Change", "code": "CHM210H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#CHM139H1\">CHM139H1</a>/<a href=\"Course_Descriptions.html#CHM151Y1\">CHM151Y1</a>,(<a href=\"Course_Descriptions.html#MAT135H1\">MAT135H1</a>,<a href=\"Course_Descriptions.html#MAT136H1\">MAT136H1</a>)/MAT135Y1/<a href=\"Course_Descriptions.html#MAT137Y1\">MAT137Y1</a>", "Exclusion": "ENV235Y1"}, "APS191H1": {"LEC": 1.0, "PRA": 0.0, "description": "<p>This is a seminar series that will preview the core fields in Engineering. Each seminar will highlight one of the major areas of Engineering. The format will vary and may include application examples, challenges, case studies, career opportunities, etc. The purpose of the seminar series is to provide first year students with some understanding of the various options within the Faculty to enable them to make educated choices for second year. This course will be offered on a credit/no credit basis.</p><br>", "TUT": 0.0, "code": "APS191H1", "wintersections": {"LEC0101": ["", "", "Stickel, Micah", [["SF1105", ["R", 12.0, 13.0]]]]}, "SC": ["S"], "CR": 0.15, "SEM": 0, "name": "Introduction to Engineering"}, "MIE407H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>This course covers the basic principles of the neutronic design and analysis of nuclear fission reactors with a focus on Generation IV nuclear systems. Topics include radioactivity, neutron interactions with matter, neutron diffusion and moderation, the fission chain reaction, the critical reactor equation, reactivity effects and reactor kinetics. Multigroup neutron diffusion calculations are demonstrated using fast-spectrum reactor designs.<br /></br><br /></br></p><br>", "fallsections": {"TUT0101": ["", "", "", [["WB130", ["F", 12.0, 14.0]]]], "LEC0101": ["", "", "Lebenhaft, Julian", [["BA1240", ["R", 16.0, 17.0]]]]}, "TUT": 2.0, "Recommended Preparation": "<a href=\"Course_Descriptions.html#CHE566H1\">CHE566H1</a>", "code": "MIE407H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#MIE230H1\">MIE230H1</a> or equivalent", "name": "Nuclear Reactor Theory and Design"}, "MIE459H1": {"LEC": 4.0, "PRA": 0.0, "description": "<p>Study of design, innovation, change and implementation issues in both new and existing organizations. Consideration will be given to sociotechnical systems design methodology, work teams, support systems, project management, and union-management relations.</p><br>", "TUT": 0.0, "code": "MIE459H1", "wintersections": {"LEC0101": ["", "", "Quan, Vinh", [["BA1180", ["T", 16.0, 18.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "name": "Organization Design"}, "CHE297Y1": {"LEC": 0.0, "PRA": 0.0, "description": "Each student will develop a portfolio of communication assignments completed in other university courses.  Contents of the portfolio will demonstrate among them a range of skills:  individual and group work, written and oral communications; expository, persuasive and research-based writings, and iterative composition.  Students will generate a critical reflection on the items included in the portfolio.  Those whose communication work is not up to standard will be provided with opportunity for remedial work. The course will allow for integration of communication work across the curriculum. The course will be offered on a credit/no credit basis.  Students who receive no credit for this course must retake it in year 3.<br>\n<br>\n", "TUT": 0.25, "code": "CHE297Y1", "SC": ["Y"], "CR": 0.0, "SEM": 0, "name": "Seminar Course: Communications Portfolio I"}, "HPS281H1": {"LEC": 2.0, "PRA": 0.0, "description": "<p style=\"text-align: justify;\">The origins of technology and engineering, from the civilizations of the Ancient World, Greece and Rome, through the Medieval World and the Renaissance. Emphasis on the developments of techniques and machines with an indication of the context in which these occur. (To be offered in the Winter Session ).</p><br>", "TUT": 1.0, "code": "HPS281H1", "SC": ["F", "S"], "CR": 0.5, "SEM": 0, "name": "History of Technology and Engineering Pre-Industrial Revolution"}, "CHE470H1": {"LEC": 3.0, "PRA": 0.0, "description": "A course covering selected topics in Chemical Engineering, not covered in other electives. Different topics may be covered each year depending on the interest of the Staff and students. May not be offered every year. Limited enrolment: permission of the Department required.<br>\n<br>\n", "TUT": 1.0, "code": "CHE470H1", "SC": ["F", "S"], "CR": 0.5, "SEM": 0, "name": "Special Topics in Chemical Engineering"}, "CHE249H1": {"LEC": 3.0, "PRA": 0.0, "description": "Engineering analysis and design are not ends in themselves, but they are a means for satisfying human wants.  Thus, engineering concerns itself with the materials used and forces and laws of nature, and the needs of people.  Because of scarcity of resources and constraints at all levels, engineering must be closely associated with economics.  It is essential that engineering proposals be evaluated in terms of worth and cost before they are undertaken.  In this course we emphasize that an essential prerequisite of a successful engineering application is economic feasibility.  Hence, investment proposals are evaluated in terms of economic cost concepts, including break even analysis, cost estimation and time value of money.   Effective interest rates, inflation and deflation, depreciation and income tax all affect the viability of an investment. Successful engineering projects are chosen from valid alternatives considering such issues as buy or lease, make or buy, cost and benefits and financing alternatives.  Both public sector and for-profit examples are used to illustrate the applicability of these rules and approaches.<br>\n<br>\n", "fallsections": {"TUT0101": ["", "", "Chan, Arthur", [["GB404", ["F", 15.0, 16.0]]]], "LEC0101": ["", "", "Chan, Arthur", [["SF1105", ["R", 9.0, 10.0]]]]}, "TUT": 1.0, "code": "CHE249H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "name": "Engineering Economic Analysis"}, "MIE563H1": {"LEC": 3.0, "PRA": 3.0, "description": "<p>This course explores exact solution techniques for common engineering Partial Differential Equations (PDEs), such as separation of variables, superposition, eigenfunctions, orthogonal functions, complex functions. Other topics include: derivation of common engineering PDEs, introduction to methods of weighted residuals for deriving finite element formulations and limitations of exact solutions relative to approximate solutions.</p><br>", "TUT": 2.0, "code": "MIE563H1", "SC": ["S"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#MIE230H1\">MIE230H1</a>, <a href=\"Course_Descriptions.html#MAT234H1\">MAT234H1</a>, <a href=\"Course_Descriptions.html#MIE334H1\">MIE334H1</a>", "name": "Engineering Analysis II"}, "BME499Y1": {"LEC": 0.0, "PRA": 7.0, "description": "<p>The goal of this course is to provide the students with some perspective with respect to the innovative work being done in the field. Students will take 2 modules in this course (one per term), each of which exposes them to biomedical research and development activity that leads to applied knowledge in the field of biomedical engineering. Each module will include at minimum 90 hours of hands-on exposure to activity in one of IBBME's core or cross-appointed faculty members lab, and to carry out the development of a research proposal related to the topic given to the student. The activities will expose the student to the design of experiments, the use of analytical equiment, and the relevant literature (scientific, patent and regulatory) related to the topic of research identified by the faculty member. Approval to register in the course must be obtained from the Associate Chair, IBBME - Undergraduate and is normally restricted to students with a cumulative average of at least B in the year prior.</p><br>", "TUT": 0.0, "code": "BME499Y1", "Corequisite": "<a href=\"Course_Descriptions.html#MIE331H1\">MIE331H1</a>", "SC": ["Y"], "CR": 1.0, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#CHE353H1\">CHE353H1</a> or equivalent", "name": "Innovation and Applied Research "}, "CHM310H1": {"LEC": 2.0, "PRA": 0.0, "description": "<p>This course considers carbon-containing molecules in the environment from a variety of perspectives: the carbon cycle, climate change and ocean acidification; fossil fuels and alternative energy sources; and the partitioning and degradation pathways of organic chemicals.</p><br>", "TUT": 0.0, "code": "CHM310H1", "SC": ["S"], "CR": 0.5, "SEM": 0, "Prerequisite": "(<a href=\"Course_Descriptions.html#CHM138H1\">CHM138H1</a>, <a href=\"Course_Descriptions.html#CHM139H1\">CHM139H1</a>)/<a href=\"Course_Descriptions.html#CHM151Y1\">CHM151Y1</a>, (<a href=\"Course_Descriptions.html#MAT135H1\">MAT135H1</a>, <a href=\"Course_Descriptions.html#MAT136H1\">MAT136H1</a>)/MAT135Y1/<a href=\"Course_Descriptions.html#MAT137Y1\">MAT137Y1</a>", "name": "Environmental Chemistry"}, "MAT363H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>Curves and surfaces in 3-spaces. Frenet formulas. Curvature and geodesics. Gauss map. Minimal surfaces. Gauss-Bonnet theorem for surfaces. Surfaces of constant curvature.</p><br>", "TUT": 0.0, "name": "Geometry of Curves and Surfaces", "code": "MAT363H1", "SC": ["S"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#MAT224H1\">MAT224H1</a>/<a href=\"Course_Descriptions.html#MAT247H1\">MAT247H1</a>, <a href=\"Course_Descriptions.html#MAT237Y1\">MAT237Y1</a>/<a href=\"Course_Descriptions.html#MAT257Y1\">MAT257Y1</a>", "Exclusion": "<a href=\"Course_Descriptions.html#MAT367H1\">MAT367H1</a>"}, "ESS241H1": {"LEC": 2.0, "PRA": 3.0, "description": "<p>Field observations, description and classification of geological structures: stratigraphic and intrusive contacts, unconformities; relative age determination; folds and fold systems; faults and fault systems; boudinage, foliations and lineations; spherical projections and mechanical principles (stress, strain, rheology). Practical work focuses on reading geological maps, constructing cross-sections, andinterpreting both in terms ofgeological processes and histories.</p><br>", "fallsections": {"LEC5101": ["", "", "", [["ESB142", ["T", 17.0, 19.0]]]]}, "TUT": 0.0, "Recommended Preparation": "(<a href=\"Course_Descriptions.html#PHY131H1\">PHY131H1</a>,<a href=\"Course_Descriptions.html#PHY132H1\">PHY132H1</a>)/(<a href=\"Course_Descriptions.html#PHY151H1\">PHY151H1</a>,<a href=\"Course_Descriptions.html#PHY152H1\">PHY152H1</a>)", "name": "Geologic Structures and Maps", "code": "ESS241H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "Exclusion": "GLG345H1"}, "CIV499H1": {"LEC": 0.0, "PRA": 0.0, "description": "<p>Individual Projects are arranged between the student and a supervising faculty member. The individual project can have either a design project focus or a research focus. If the focus is on design then the design project can be either motivated by the <a href=\"Course_Descriptions.html#CIV498H1\">CIV498H1</a> Group Design Project experience, or it can be entirely new. The students work must culminate in a final design report or a thesis, as well as an oral presentation. The grading of both the final written submission as well as the oral presentation is carried out by the supervising faculty member. The Individual Project may be undertaken in either the Fall (F) or Winter (S) Session, but not both (i.e., the Individual Project carries a maximum weight of 0.5; it cannot be made into a full year course)</p><br>", "fallsections": {"TUT0101": ["", "", "", [["", ["F", 8.0, 9.0]]]]}, "TUT": 3.0, "code": "CIV499H1", "SC": ["F", "S"], "CR": 0.5, "SEM": 0, "name": "Individual Project"}, "AER210H1": {"LEC": 3.0, "PRA": 0.5, "description": "<p>The first part of this course covers multiple integrals and vector calculus. Topics covered include: double and triple integrals, derivatives of definite integrals, surface area, cylindrical and spherical coordinates, general coordinate transformations (Jacobians), Taylor series in two variables, line and surface integrals, parametric surfaces, Greens theorem, the divergence and gradient theorems, Stokess theorem. The second part of the course provides a general introduction to the principles of continuum fluid mechanics. The basic conservation laws are derived in both differential and integral form, and the link between the two is demonstrated. Applications covered include hydrostatics, incompressible and compressible frictionless flow, the speed of sound, the momentum theorem, viscous flows, and selected examples of real fluid flows.</p><br>", "fallsections": {"PRA0101": ["", "", "", [["MB325", ["W", 9.0, 12.0]]]], "PRA0103": ["", "", "", [["MB325", ["W", 14.0, 17.0]]]], "PRA0102": ["", "", "", [["MB325", ["W", 9.0, 12.0]]]], "LEC0102": ["", "", "Ekmekci, Alis and Davis, James", [["GB119", ["F", 11.0, 12.0]]]], "PRA0104": ["", "", "", [["WB125", ["W", 14.0, 17.0]]]], "LEC0101": ["", "", "Davis, James and Ekmekci, Alis", [["GB119", ["M", 12.0, 13.0]]]], "TUT0101": ["", "", "", [["BA3116", ["W", 17.0, 18.0]]]], "TUT0103": ["", "", "", [["BA2159", ["W", 17.0, 18.0]]]], "TUT0102": ["", "", "", [["BA3008", ["W", 17.0, 18.0]]]], "TUT0105": ["", "", "", [["BA2139", ["W", 17.0, 18.0]]]], "TUT0104": ["", "", "", [["BA2175", ["W", 17.0, 18.0]]]], "TUT0106": ["", "", "", [["BA2135", ["W", 17.0, 18.0]]]]}, "TUT": 2.0, "code": "AER210H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "name": "Vector Calculus "}, "CIV331H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>This course introduces the fundamentals of transportation systems and the application of engineering, mathematical and economic concepts and principles to address a variety of transportation issues in Canada. Several major aspects of transportation engineering will be addressed, including transportation planning, public transit, traffic engineering, geometric design, pavement design and the economic, social and environmental impacts of transportation. The course focuses on urban transportation engineering problems.</p><br>", "fallsections": {"TUT0101": ["", "", "", [["BA2195", ["T", 17.0, 18.0]]]], "TUT0102": ["", "", "", [["GB405", ["T", 17.0, 18.0]]]], "LEC0101": ["", "", "Roorda, Matthew", [["SF1101", ["R", 9.0, 11.0]]]]}, "TUT": 1.0, "code": "CIV331H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "name": "Transport I - Introduction to Urban Transportation Systems"}, "HPS280H1": {"LEC": 2.0, "PRA": 0.0, "description": "<p>This course surveys the development of science from Antiquity to the modern times. We focus on a number of selected topics, ranging from the mechanical worldview to particle physics, from the classification of species to molecular biology, from the introduction of laboratory to the interaction between war and science. Our aim is to explore how and why science came to its current form and status by addressing crucial discoveries and conceptual breakthroughs, conditions and standards indispensable to scientific research, and principal mutual influences between science and society.</p>\r\n<p></p><br>", "TUT": 1.0, "code": "HPS280H1", "SC": ["F", "S"], "CR": 0.5, "SEM": 0, "name": "History of Science"}, "PHY407H1": {"LEC": 1.0, "PRA": 3.0, "description": "<p>This is an introduction to problem solving by computer where symbolic, numeric and graphical approaches are combined. The emphasis is on a range of ordinary and partial differential equations encountered in physics. Special functions, wave functions, Lagrangians and Monte Carlo methods are also considered.</p><br>", "fallsections": {"LEC0101": ["", "", "", [["MP134", ["M", 16.0, 17.0]]]]}, "TUT": 0.0, "name": "Computational Physics", "code": "PHY407H1", "Corequisite": "Any third-year lecture course in Physics. <a href=\"Course_Descriptions.html#PHY407H1\">PHY407H1</a> may be taken in third or fourth year.", "SC": ["F"], "CR": 0.5, "SEM": 0, "Prerequisite": "<a href=\"Course_Descriptions.html#PHY224H1\">PHY224H1</a>/<a href=\"Course_Descriptions.html#PHY250H1\">PHY250H1</a>/<a href=\"Course_Descriptions.html#PHY324H1\">PHY324H1</a>", "Exclusion": "PHY307H1"}, "BME358H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>Topics to be covered will include: review of basic protein structure; molecular forces; thermodynamics of living systems: protein folding, physics of many-particle systems; open systems and chemical thermodynamics: Gibbs free energy and chemical potential; bioenergetics and molecular motors; electrical properties of living cells: Poisson-Boltzmann, membrane potential, cardiac cell and other excitable cells; chemical kinetics and reactions; mechanical properties of biomolecules; molecular manipulation techniques.</p><br>", "TUT": 1.0, "code": "BME358H1", "wintersections": {"TUT0101": ["", "", "", [["BA1230", ["T", 17.0, 18.0]]]], "LEC0101": ["", "", "Yip, Christopher", [["BA1230", ["T", 16.0, 17.0]]]]}, "SC": ["S"], "CR": 0.5, "SEM": 0, "name": "Molecular Biophysics"}, "CIV355H1": {"LEC": 3.0, "PRA": 0.0, "description": "<p>This course focuses on quantitative methods and techniques for the analysis and modelling of urban transportation and service systems. Major topics include probabilistic modelling, queuing models of transport operations, network models, mathematical programming and simulation. The application of these methods to modeling various components of the urban transportation system (including road, transit and pedestrian facilities) and to the planning and design of logistically-oriented urban service systems (e.g., fire and police departments, emergency medical services, etc..) is emphasized.</p><br>", "fallsections": {"TUT0101": ["", "", "", [["WB219", ["F", 15.0, 17.0]]]], "LEC0101": ["", "", "Shalaby, Amer", [["WB119", ["R", 10.0, 12.0]]]]}, "TUT": 2.0, "code": "CIV355H1", "SC": ["F"], "CR": 0.5, "SEM": 0, "name": "Urban Operations Research"}}