{"AST221H1": {"course_description": "<p>The (astro)physics of stars and planets, their observed variety, their structure, formation and evolution. Introduction to telescopes and instrumentation.\r\nPrerequisite:\r\n                    <a href=\"crs_phy.htm#PHY132H1\">PHY132H1</a>/<a href=\"crs_phy.htm#PHY152H1\">PHY152H1</a>/<a href=\"crs_phy.htm#PHY180H1\">PHY180H1</a>Exclusion:\r\n                    <a href=\"crs_ast.htm#AST101H1\">AST101H1</a>/<a href=\"crs_ast.htm#AST201H1\">AST201H1</a>Distribution Requirement Status:  This is a Science courseBreadth Requirement:  The Physical and Mathematical Universes (5)\r\n", "LEC": 36, "course_name": "Stars and Planets", "name": "Stars and Planets", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["Y", "", "C.Matzner", [["AB 107", ["M", 12, 13], ["W", 12, 13], ["F", 12, 13]]], "", "65"]}, "SC": "F", "CR": 0.5, "course_code": "AST221H1", "SEM": 0}, "PRT399Y0": {"course_description": "<p>An instructor-supervised group project in an off-campus setting. Details at <a href=\"http://www.artsci.utoronto.ca/current/course/399\">http://www.artsci.utoronto.ca/current/course/399</a>. Not eligible for CR/NCR option.\r\nDistribution Requirement Status:  This is a Humanities courseBreadth Requirement:  None\r\n", "LEC": 0, "course_name": "Research Excursions", "TUT": 0, "PRA": 0, "CR": 1, "course_code": "PRT399Y0", "SEM": 0}, "GRK441H1": {"course_description": "<p>Advanced readings from one or more Greek historians.\r\nPrerequisite:\r\n                    One FCE in the GRK 300-seriesDistribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 0, "course_name": "Greek Historians II", "TUT": 0, "PRA": 0, "CR": 0.5, "course_code": "GRK441H1", "SEM": 48}, "HIS428H1": {"course_description": "<p>The first goal of this seminar is to help students read the sources with a more critical eye, especially narrative sources (Lives of Saints) and normative sources (rules and customaries). The second goal is to study the evolution of the monastic ideal from its origin to the 12th century. (Joint undergraduate-graduate)\r\nPrerequisite:\r\n                    A course specifically on the Middle Ages such as <a href=\"crs_his.htm#HIS220Y1\">HIS220Y1</a>Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Society and its Institutions (3)\r\n", "LEC": 0, "course_name": "Medieval Institutes of Perfection", "TUT": 0, "PRA": 0, "CR": 0.5, "course_code": "HIS428H1", "SEM": 24}, "ECO423H1": {"course_description": "<p>Themes are incentives, contracts, and the impetus for change. Topics include indigenous people of North America; indentured servitude; slavery; apprenticeships; the evolution of production from artisan shop to the factory; invention and the diffusion of technological innovations; institutions and growth.\r\nPrerequisite:\r\n                    <a href=\"crs_eco.htm#ECO206Y1\">ECO206Y1</a>(70%),<a href=\"crs_eco.htm#ECO220Y1\">ECO220Y1</a>(70%)/<a href=\"crs_eco.htm#ECO227Y1\">ECO227Y1</a>(70%)/<a href=\"crs_sta.htm#STA257H1\">STA257H1</a>(70%),<a href=\"crs_sta.htm#STA261H1\">STA261H1</a>(70%), or permission of the instructorExclusion:\r\n                    ECO307H1Distribution Requirement Status:  This is a Social Science courseBreadth Requirement:  Society and its Institutions (3)\r\n", "LEC": 24, "course_name": "Topics in North American Economic History", "TUT": 12, "PRA": 0, "CR": 0.5, "course_code": "ECO423H1", "SEM": 0}, "NML450H1": {"course_description": "<p>Advanced survey of phonology, morphology, syntax, semantics, and pragmatics of ancient Hebrew. Introduction to the various methods used to investigate ancient Hebrew.\r\nPrerequisite:\r\n                    <a href=\"crs_nmc.htm#NML250Y1\">NML250Y1</a>, and one NML300-series courseExclusion:\r\n                    NML450Y1Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 0, "course_name": "Advanced Biblical Hebrew Grammar", "TUT": 0, "PRA": 0, "CR": 0.5, "course_code": "NML450H1", "SEM": 36}, "HPS326H1": {"course_description": "<p>From its origins in the Renaissance, modern science has developed in the context of European religious beliefs and institutions. Although cases of conflict like Galileo or the Monkey Trial are famous, more common are cases of scientists like Newton or Faraday whose religious convictions were crucial to their scientific success.\r\nDistribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Society and its Institutions (3)\r\n", "LEC": 0, "course_name": "History of Science and Religion", "name": "Hist of Sci & Relg", "TUT": 12, "PRA": 0, "wintersections": {"T5401": ["N", "", "", [["", ["T", 19, 20]]]], "T5301": ["N", "", "", [["", ["W", 18, 19]]]], "T5101": ["N", "", "", [["", ["T", 18, 19]]]], "L5101": ["Y", "", "Y. Fehige", [["EM 001", ["M", 18, 20]]]], "T5201": ["N", "", "", [["", ["T", 19, 20]]]]}, "SC": "S", "CR": 0.5, "course_code": "HPS326H1", "SEM": 12}, "PHL268H1": {"course_description": "<p>Is the objective of philosophy to understand and interpret the world, or to change it? A study of theorists who have taken philosophy to be a tool for social criticism. Topics studied may include feminism, critical race theory, anti-consumerism, the critique of mass society, and conservative cultural criticism.\r\nDistribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Society and its Institutions (3)\r\n", "LEC": 36, "course_name": "Philosophy and Social Criticism", "TUT": 0, "PRA": 0, "CR": 0.5, "course_code": "PHL268H1", "SEM": 0}, "CME185H1": {"course_description": "<p>This course introduces students to the basic earth sciences with an emphasis on understanding the impact of humans on the natural earth systems. Beginning with a study of the lithosphere, principles of physical geology will be examined including the evolution and internal structure of the earth, dynamic processes that affect the earth, formation of minerals and rocks and soil, ore bodies and fossil- energy sources. Next, the biosphere will be studied, including the basic concepts of ecology including systems ecology and biogeochemical cycles. The influence of humans and the built environment on these natural systems will also be examined with a view to identifying more sustainable engineering practices. Finally, students will study the oceans and the atmosphere and the physical, chemical and thermodynamic processes involved in climate change.</p><br>\n", "LEC": 36.0, "course_name": "Earth Systems Science", "TUT": 12.0, "PRA": 24.0, "wintersections": {"PRA0101": ["", "", "", [["ES1062", ["W", 15.0, 17.0]], ["ES1067", ["W", 15.0, 17.0]]]], "TUT0101": ["", "", "", [["SF1105", ["R", 11.0, 12.0]]]], "PRA0102": ["", "", "", [["ES1062", ["F", 15.0, 17.0]], ["ES1067", ["F", 15.0, 17.0]]]], "LEC0101": ["", "", "Peterson, Karl", [["TZ6", ["W", 10.0, 12.0]], ["WB116", ["F", 10.0, 11.0]]]]}, "SC": ["S"], "CR": 0.5, "course_code": "CME185H1", "SEM": 0}, "CIV313H1": {"course_description": "<p>This course provides an introduction to the design of reinforced concrete structures. Concrete technology, properties of concrete and reinforcing steel, construction practice, and general code requirements are discussed. Analysis and design of members under axial load, flexure, shear, and restraint force are examined in detail. Other aspects of design covered include control of cracks, minimum and maximum reinforcement ratios, fire resistance, durability, distress and failure. A major design project, done in teams of two and accounting for 15% of the final mark, requires students to formulate a complete design for a structural system such as a pedestrian bridge or floor system. Project requirements include consideration of alternative designs in terms of structural efficiency and total costs.</p><br>Prerequisite:\n                    <a href=\"Course_Descriptions.html#CIV312H1\">CIV312H1</a>\n", "LEC": 36.0, "course_name": "Reinforced Concrete I", "TUT": 24.0, "PRA": 0.0, "wintersections": {"TUT0101": ["", "", "Vecchio, Frank", [["GB405", ["F", 12.0, 14.0]], ["HA403", ["F", 12.0, 14.0]]]], "LEC0101": ["", "", "Vecchio, Frank", [["SF1101", ["M", 17.0, 18.0]], ["SF1101", ["W", 16.0, 18.0]]]]}, "SC": ["S"], "CR": 0.5, "course_code": "CIV313H1", "SEM": 0}, "RSM250H1": {"course_description": "<p>Students receive an introduction to the basic concepts, theories, and methods of contemporary marketing. The course offers a comprehensive framework to develop successful marketing efforts and allows students to create a marketing plan. Specific topics examined: market research, consumer behaviour, segmentation, product policy, pricing, distribution, communications, sales, and direct marketing. Not eligible for CR/NCR option. Contact Rotman Commerce for details.\r\nPrerequisite:\r\n                    <a href=\"crs_rsm.htm#RSM100Y1\">RSM100Y1</a>Distribution Requirement Status:  This is a Social Science courseBreadth Requirement:  Thought, Belief and Behaviour (2)\r\n", "LEC": 24, "course_name": "Principles of Marketing", "name": "Principles Marketing", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["Y", "R", "Lee/Soman", [["WW 126", ["M", 12, 14]]], "", "50"], "L0201": ["Y", "R", "Lee/Soman", [["WW 126", ["M", 14, 16]]], "", "50"], "L0301": ["Y", "R", "R.Webb", [["WW 121", ["R", 9, 11]]], "", "50"], "L0401": ["Y", "R", "R.Webb", [["WW 121", ["R", 11, 13]]], "", "55"]}, "SC": "S", "CR": 0.5, "course_code": "RSM250H1", "SEM": 0}, "ECE221H1": {"course_description": "<p>The fundamental laws of electromagnetics are covered, including Coulomb's law, Gauss' law, Poisson's and Laplace's equations, the Biot-Savart law, Ampere's law, Faraday's law, and Maxwell's equations. Vector calculus is applied to determine the relationship between the electric and magnetic fields and their sources (charges and currents). The interaction of the fields with material media will be discussed, including resistance, polarization in dielectrics, magnetization in magnetic materials, properties of magnetic materials and boundary conditions. Other topics include: electric and magnetic forces, the electric potential, capacitance and inductance, electric and magnetic energy, magnetic circuits, and boundary-value problems.</p><br>\n", "LEC": 36.0, "course_name": "Electric and Magnetic Fields", "TUT": 24.0, "PRA": 12.0, "wintersections": {"TUT0106": ["", "", "", [["GB404", ["F", 9.0, 11.0]]]], "PRA0101": ["", "", "", [["SF2102", ["W", 16.0, 18.0]], ["GB251", ["W", 16.0, 18.0]]]], "PRA0105": ["", "", "", [["GB251", ["T", 9.0, 11.0]], ["SF2102", ["T", 9.0, 11.0]]]], "PRA0103": ["", "", "", [["GB251", ["R", 13.0, 15.0]], ["SF2102", ["R", 13.0, 15.0]]]], "PRA0102": ["", "", "", [["SF2102", ["W", 16.0, 18.0]], ["GB251", ["W", 16.0, 18.0]]]], "LEC0102": ["", "", "Stickel, Micah", [["BA1130", ["M", 10.0, 11.0]], ["BA1130", ["T", 11.0, 12.0]], ["BA1130", ["R", 10.0, 11.0]]]], "LEC0103": ["", "", "Stickel, Micah", [["BA1130", ["W", 11.0, 12.0]], ["BA1130", ["R", 11.0, 12.0]], ["BA1130", ["M", 11.0, 12.0]]]], "LEC0101": ["", "", "Shokrollah-Timorabadi, Hamid", [["BA1180", ["M", 13.0, 14.0]], ["BA1180", ["T", 14.0, 15.0]], ["BA1180", ["R", 13.0, 14.0]]]], "TUT0101": ["", "", "", [["GB404", ["R", 9.0, 11.0]]]], "TUT0103": ["", "", "", [["GB304", ["F", 13.0, 15.0]]]], "TUT0102": ["", "", "", [["GB412", ["R", 9.0, 11.0]]]], "TUT0105": ["", "", "", [["SF3201", ["F", 9.0, 11.0]]]], "TUT0104": ["", "", "", [["SF3201", ["F", 13.0, 15.0]]]], "PRA0106": ["", "", "", [["GB251", ["T", 15.0, 17.0]], ["SF2102", ["T", 15.0, 17.0]]]], "PRA0104": ["", "", "", [["SF2102", ["R", 13.0, 15.0]], ["GB251", ["R", 13.0, 15.0]]]]}, "SC": ["S"], "CR": 0.5, "course_code": "ECE221H1", "SEM": 0}, "FRE310H1": {"course_description": "<p>Literary texts and other forms of media (photographs, cinematographic images, paintings) have been associated in a fascinating relation in hundreds of works of French literature. An exploration of this inextricable weaving together of verbal and visual experiences as it pertains to literature through the study of interdisciplinary theoretical texts focused on photography, painting, and cinema.\r\nPrerequisite:\r\n                    <a href=\"crs_fre.htm#FRE240H1\">FRE240H1</a>Recommended Preparation:\r\n                    <a href=\"crs_fre.htm#FRE241H1\">FRE241H1</a>Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 24, "course_name": "Relations between Text and Other Media", "name": "Text & Other Media", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["N", "", "J. Leblanc", [["NF 006", ["M", 14, 16]]]]}, "SC": "S", "CR": 0.5, "course_code": "FRE310H1", "SEM": 0}, "UNI267H1": {"course_description": "<p>A critical examination of contemporary forms of Canadian nationalism. This interdisciplinary course will interrogate national formations across theoretical works, policy documents, and cultural representations. Students will address the ways that nationalist discourses constitute difference, especially with respect to race, ethnicity, gender, and sexuality.\r\nExclusion:\r\n                    UNI220Y1Enrolment Limits:\r\n                    Priority: ASMAJ0728 (Ma Canadian Studies); ASSPE0728 (Sp Canadian Studies); ASMIN0728 (Mi Canadian Studies); ASMIN2728 (Mi Asian Canadian Studies) Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 24, "course_name": "Canadian Nationalisms (formerly UNI220Y1)", "name": "Canadian Nationalisms", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["Y", "P", "Tba", [["UC 161", ["M", 10, 12]]], "", "97"]}, "SC": "F", "CR": 0.5, "course_code": "UNI267H1", "SEM": 0}, "VIC363H1": {"course_description": "<p>This course will challenge the widely accepted idea that people need to be born with a special gift or natural ability to excel in mathematics. New research in education and cognitive science suggests that young learners often struggle in school because they are not taught in a way that allows their brains to work efficiently. This course will examine barriers that prevent students from learning and methods of teaching that can help all students reach their full potential (not only in math). Math lovers and math phobic students are welcome: the course aims to help students develop deeper levels of confidence and understanding in mathematics so they can become effective teachers themselves.\r\nPrerequisite:\r\n                    Enrolment in Vic CTEP or Education and Society MinorDistribution Requirement Status:  This is a Social Science courseBreadth Requirement:  Society and its Institutions (3)", "LEC": 0, "course_name": "Teaching Math: The JUMP Approach", "name": "Teach Math: JUMP App", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["N", "P\r\n  (note: indicator change)\r\n", "J. Mighton", [["NF 119", ["W", 16, 18]]]]}, "SC": "S", "CR": 0.5, "course_code": "VIC363H1", "SEM": 24}, "VIC304H1": {"course_description": "<p>This course will explore what it means to act in cultural, political, religious, and psychological realms. We focus on the historically shifting relations between theory and practice, between artifice and agency, and between theatricality and spectatorship.\r\nRecommended Preparation:\r\n                    <a href=\"crs_vic.htm#VIC202Y1\">VIC202Y1</a>Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 0, "course_name": "Praxis and Performance", "name": "Praxis & Perform", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["Y", "P", "E. Jagoe", [["VC 304", ["M", 12, 14]]], "", "25"]}, "SC": "F", "CR": 0.5, "course_code": "VIC304H1", "SEM": 0}, "HPS411H1": {"course_description": "<p>An examination of foundational and conceptual aspects of mathematics such as: the nature of mathematical objects, logicism, Churchs elementalistic mathematics, Gdels theorem and formal systems, postulational methods, mathematics and reality, the cardinal, ordinal and abstract approaches to numbers, infinity, and Euclidean and non-Euclidean geometries. Not eligible for CR/NCR option.\r\nPrerequisite:\r\n                    <a href=\"crs_phl.htm#PHL245H1\">PHL245H1</a>/<a href=\"crs_hps.htm#HPS390H1\">HPS390H1</a> or <a href=\"crs_hps.htm#HPS391H1\">HPS391H1</a> or <a href=\"crs_hps.htm#HPS410H1\">HPS410H1</a> or permission of the instructorExclusion:\r\n                    <a href=\"crs_phl.htm#PHL346H1\">PHL346H1</a>Distribution Requirement Status:  This is a Humanities or Science courseBreadth Requirement:  The Physical and Mathematical Universes (5)\r\n", "LEC": 0, "course_name": "Conceptual Foundations of Mathematics", "TUT": 0, "PRA": 0, "CR": 0.5, "course_code": "HPS411H1", "SEM": 24}, "CIN314Y1": {"course_description": "<p>Study of theoretical-analytical models of film genres, narrative form, and narration. Structuralist, cognitive-neoformalist, and historiographical approaches will be developed.Genres to be studied include:Westerns, musicals, crime films, biography films,gothic and fantastic films, and art cinema.\r\nPrerequisite:\r\n                    <a href=\"crs_cin.htm#CIN105Y1\">CIN105Y1</a> Exclusion:\r\n                    INI329Y1Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1) + Thought, Belief and Behaviour (2)\r\n", "LEC": 48, "course_name": "Genre, Narrative and Narration in Film (formerly INI329Y1)", "TUT": 0, "PRA": 72, "CR": 1, "course_code": "CIN314Y1", "SEM": 0}, "MIE444H1": {"course_description": "<p>This course provides students with the tools to design, model, analyze and control mechatronic systems (e.g. smart systems comprising electronic, mechanical, fluid and thermal components). This is done through the synergic combination of tools from mechanical and electrical engineering, computer science and information technology to design systems with built-in intelligence. The class provides techniques for the modeling of various system components into a unified approach and tools for the simulation of the performance of these systems. The class also presents the procedures and an analysis of the various components needed to design and control a mechatronic system including sensing, actuating, and I/O interfacing components.</p><br>Prerequisite:\n                    <a href=\"Course_Descriptions.html#MIE342H1\">MIE342H1</a>, <a href=\"Course_Descriptions.html#MIE346H1\">MIE346H1</a>\n", "LEC": 24.0, "course_name": "* Mechatronics Principles", "fallsections": {"PRA0101": ["", "", "", [["MC402", ["T", 15.0, 18.0]]]], "LEC0101": ["", "", "Ben Mrad, Ridha", [["MC402", ["T", 10.0, 11.0]], ["MC402", ["W", 10.0, 11.0]], ["RS310", ["T", 10.0, 11.0]], ["RS310", ["W", 10.0, 11.0]]]]}, "TUT": 0.0, "PRA": 36.0, "SC": ["F"], "CR": 0.5, "course_code": "MIE444H1", "SEM": 0}, "CME368H1": {"course_description": "<p>The incorporation of economic and non-monetary considerations for making decision about public and private sector engineering systems in urban and other contexts. Topics include rational decision making; cost concepts; time value of money and engineering economics; microeconomic concepts; treatment of risk and uncertainty; and public project evaluation techniques incorporating social and environmental impacts including benefit cost analysis and multi-objective analysis.</p><br>Exclusion:\n                    CIV368H1", "LEC": 36.0, "course_name": "Engineering Economics and Decision Making", "fallsections": {"LEC5101": ["", "", "Fernandez, Eduardo", [["BA1230", ["U", 9.0, 13.0]]]], "TUT0101": ["", "", "", [["GB119", ["W", 10.0, 11.0]]]], "TUT0102": ["", "", "", [["SF3202", ["W", 10.0, 11.0]]]], "LEC0101": ["", "", "Kennedy, Christopher", [["WB116", ["F", 12.0, 14.0]], ["WB116", ["T", 13.0, 14.0]]]]}, "TUT": 12.0, "PRA": 0.0, "SC": ["F"], "CR": 0.5, "course_code": "CME368H1", "SEM": 0}, "STR261H0": {"course_description": "<p>This course introduces students to the tools, principles, and methods used in translation, from both a practical and theoretical perspective. Individual and group exercises and assignments help students acquire both basic skills and an understanding of the translation process. (Co-listed as GL/TRAN 2210 Glendon College)\r\nPrerequisite:\r\n                    Permission of the Slavic DepartmentDistribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 0, "course_name": "Introduction to Translation into English I ", "TUT": 0, "PRA": 36, "CR": 0.5, "course_code": "STR261H0", "SEM": 0}, "NML470Y1": {"course_description": "<p>Advanced Turkish language practice designed to enable students to pursue independent work in Turkish and Ottoman studies. Differences between modern Turkish and Ottoman grammar will be pointed out. Elements of Arabic and Persian grammar that occur in Ottoman will be presented.\r\nPrerequisite:\r\n                    NML370Y1 or adequate knowledge of TurkishDistribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 0, "course_name": "Advanced Turkish ", "TUT": 0, "PRA": 0, "CR": 1, "course_code": "NML470Y1", "SEM": 48}, "ECE417H1": {"course_description": "<p>Basic concepts of digital communication. Baseband data transmission, intersymbol interference, Nyquist pulse shaping, equalization, line coding, multi-path fading, diversity. Binary and M-ary modulation schemes, synchronization. Signal space concepts, optimum receivers, coherent and noncoherent detectors. Information theory, source encoding, error control coding, block and convolutional codes.</p><br>Prerequisite:\n                    <a href=\"Course_Descriptions.html#ECE302H1\">ECE302H1</a> and <a href=\"Course_Descriptions.html#ECE316H1\">ECE316H1</a>, or <a href=\"Course_Descriptions.html#STA286H1\">STA286H1</a>\n", "LEC": 36.0, "course_name": "Digital Communication", "TUT": 12.0, "PRA": 18.0, "wintersections": {"PRA0101": ["", "", "", [["SF2201", ["F", 15.0, 18.0]]]], "TUT0101": ["", "", "", [["BA3116", ["T", 13.0, 14.0]]]], "PRA0102": ["", "", "", [["SF2201", ["F", 15.0, 18.0]]]], "TUT0102": ["", "", "", [["WB144", ["R", 12.0, 13.0]]]], "LEC0101": ["", "", "Kschischang, Frank", [["BA1200", ["R", 17.0, 18.0]], ["BA1200", ["M", 17.0, 18.0]], ["BA1200", ["W", 17.0, 18.0]]]]}, "SC": ["S"], "CR": 0.5, "course_code": "ECE417H1", "SEM": 0}, "GGR338H1": {"course_description": "<p>Describes and analyses a broad range of the key environmental issues currently facing developing countries from geographical perspectives. Emphasis is on air pollution, water contamination and treatment, residential and industrial solid waste collection and management, with multimedia and written examples drawn from throughout the developing world.\r\nRecommended Preparation:\r\n                    8.0 FCE's including one of <a href=\"crs_ggr.htm#GGR107H1\">GGR107H1</a>, <a href=\"crs_ggr.htm#GGR223H1\">GGR223H1</a>Distribution Requirement Status:  This is a Social Science courseBreadth Requirement:  Society and its Institutions (3)\r\n", "LEC": 24, "course_name": "Environmental Problems in Developing Countries", "TUT": 0, "PRA": 0, "CR": 0.5, "course_code": "GGR338H1", "SEM": 0}, "SPA255Y0": {"course_description": "<p>A survey of Hispanic Culture, with attention to central issues in history, politics, and popular traditions. Course will be taught in English.\r\nDistribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 48, "course_name": "Introduction to the Hispanic World", "TUT": 0, "PRA": 0, "CR": 1, "course_code": "SPA255Y0", "SEM": 0}, "CJS390H1": {"course_description": "<p>An examination of issues in Jewish Studies. Content in any given year depends on instructor.\r\nPrerequisite:\r\n                    Permission of the instructor/programDistribution Requirement Status:  This is a Humanities courseBreadth Requirement:  None\r\n", "LEC": 24, "course_name": "Special Topics in Jewish Studies", "name": "Special Jewish Stds", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["Y", "", "Tba", [["TC 24", ["W", 14, 16]]]]}, "SC": "S", "CR": 0.5, "course_code": "CJS390H1", "SEM": 0}, "NEW232Y1": {"course_description": "<p>Explores the contributions of Buddhism to the study of human consciousness and behaviour. Focus is on the expanding academic discourse on the intersection of Buddhist and Western theories of psychology, phenomenology and psychotherapy. Includes analyses of the application of Buddhist mindfulness meditation in clinical interventions for mental and physical disorders.<p>Exclusion:\r\n                    <a href=\"crs_new.htm#NEW402Y1\">NEW402Y1</a>, NEW432Y1<br>Distribution Requirement Status:  This is a Humanities course<br>Breadth Requirement:  Thought, Belief and Behaviour (2)<br>\r\n<br>\r\n", "LEC": 0, "course_name": " Applications (formerly NEW402Y1, NEW432Y1)", "name": "Buddhist Psychology", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["Y", "", "A. Toneatto", [["WI 1016", ["W", 16, 19]]], "", "160"]}, "SC": "Y", "CR": 1, "course_code": "NEW232Y1", "SEM": 72}, "DTS403H1": {"course_description": "<p>Food links people across space and time. As it spirals outward from parochial sites of origin to articulate with new sites, actors and scales, it assumes new substance and meaning in new locales. This movement of food gives rise to new foodways t help us to understand the past in terms of temporally connected sites of intense interaction. Food also plays a strong role in shaping translocal identities. As peoples have moved in the world, food has played a central role in (re)defining who they are, reproducing myth and ritual, and bounding diasporic communities. This course seeks to address questions surrounding the dynamics of the food we eat, the ways in which we eat, the meaning we give to eating, and the effect of eating in a transnational world. Recognizing that culinary culture is central to diasporic identifications, the focus is on the place of food in the enduring habits, rituals, and everyday practices that are collectively used to produce and sustain a shared sense of diasporic cultural identity.\r\nPrerequisite:\r\n                    <a href=\"crs_dts.htm#DTS200Y1\">DTS200Y1</a> or equivalentRecommended Preparation:\r\n                    Students should be in their final academic year of study.Distribution Requirement Status:  This is a Humanities or Social Science courseBreadth Requirement:  Society and its Institutions (3)\r\n", "LEC": 0, "course_name": "Advanced Topics in Diaspora and Transnationalism (Foodways - Diasporic Diners, Transnational Tables and Culinary Connections)", "name": "Adv Topics Diaspora\r\n      (Foodways: Diasporic Diners, Transnational Tables  Culinary Connections) ", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["Y", "PE", "K. MacDonald", [["UC 376\r\n          (Note: room change) ", ["W", 16, 18]]]]}, "SC": "S", "CR": 0.5, "course_code": "DTS403H1", "SEM": 24}, "RLG473H1": {"course_description": "<p>A survey of Vedantic thought beginning with the classical commentaries on the Brahmasutras (such as those of Sankara, Ramanuja etc.) and ending with neo-Vedanta in the writings of Dayananda Saraswati, Sri Aurobindo and Radhakrishnan.\r\nPrerequisite:\r\n                    <a href=\"crs_rlg.htm#RLG205Y1\">RLG205Y1</a>; RLG205H5; Instructor's permission required for admission to courseDistribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Thought, Belief and Behaviour (2)\r\n", "LEC": 0, "course_name": "Vedanta Through the Ages", "TUT": 0, "PRA": 0, "CR": 0.5, "course_code": "RLG473H1", "SEM": 24}, "STA398H0": {"course_description": "<p>An instructor-supervised group project in an off-campus setting. Details at <a href=\"http://www.artsci.utoronto.ca/current/course/399\">http://www.artsci.utoronto.ca/current/course/399</a>. Not eligible for CR/NCR option.\r\nDistribution Requirement Status:  This is a Science courseBreadth Requirement:  None\r\n", "LEC": 0, "course_name": "Research Excursions", "TUT": 0, "PRA": 0, "CR": 0.5, "course_code": "STA398H0", "SEM": 0}, "CIV523H1": {"course_description": "<p>This course is built around a transportation project that contains all the essential geotechnical investigation and design elements and illustrates how they all come together on a project. The students will be taken through the entire design process from project initiation to construction. In essence, the project will include a bridge over a river with some property constraints requiring the use of a retaining wall as well as deep and shallow foundations and some groundwater control. The highway will require a soil cut. One section crosses a low-lying swampy area that will require embankment construction over deep soft soils. A short tunnel section is planned beneath a railway that cannot be taken out of service. A pavement design will be required along the entire route as well as materials testing and construction monitoring.</p><br>Prerequisite:\n                    CIV321H1/<a href=\"Course_Descriptions.html#CME321H1\">CME321H1</a>; equivalent or permission of instructor\n", "LEC": 36.0, "course_name": "Geotechnical Design", "TUT": 12.0, "PRA": 0.0, "wintersections": {"TUT0101": ["", "", "", [["BA1220", ["W", 15.0, 16.0]]]], "LEC0101": ["", "", "Skinner, Graeme and Dittrich, Paul", [["GB303", ["T", 18.0, 21.0]]]]}, "SC": ["S"], "CR": 0.5, "course_code": "CIV523H1", "SEM": 0}, "ENG383H1": {"course_description": "<p>Sustained study of one school, movement, or approach in literary theory, history, or criticism. Content varies with instructors.\r\nPrerequisite:\r\n                    2.0 ENG FCE and any 4.0 FCEDistribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 36, "course_name": "Critical Methods", "name": "Critical Methods", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["Y", "P", "M. Knight", [["RW 143", ["M", 11, 12]], ["RW 143", ["W", 11, 13]]]]}, "SC": "S", "CR": 0.5, "course_code": "ENG383H1", "SEM": 0}, "PHL415H1": {"course_description": "<p>Advanced study of some area or problem in the philosophy of science.\r\nPrerequisite:\r\n                    One of <a href=\"crs_phl.htm#PHL355H1\">PHL355H1</a> â€“ <a href=\"crs_phl.htm#PHL357H1\">PHL357H1</a> or <a href=\"crs_hps.htm#HPS250H1\">HPS250H1</a>, 4.0 credits in philosophyDistribution Requirement Status:  This is a Humanities courseBreadth Requirement:  None\r\n", "LEC": 0, "course_name": "Seminar in Philosophy of Science", "name": "Seminar: Phil of Sci", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["Y", "P", "J. Brown", [["SS 570\r\n  (Note: room change)\r\n", ["R", 9, 12]]], "", "20"]}, "SC": "F", "CR": 0.5, "course_code": "PHL415H1", "SEM": 36}, "FRE446H1": {"course_description": "<p>An introduction to the dialogue between anthropology and literature throughout the ages. Reflexion on cultural patterns is a constant in French literary theory from Montaigne to Michel Leiris. This course will examine some fundamental texts and key concepts such as <em>rvolution </em><em>sociologique</em>, <em>regard loign</em>, and primitivism.\r\nPrerequisite:\r\n                    <a href=\"crs_fre.htm#FRE240H1\">FRE240H1</a> + <a href=\"crs_fre.htm#FRE241H1\">FRE241H1</a> + <a href=\"crs_fre.htm#FRE344H1\">FRE344H1</a>Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)", "LEC": 0, "course_name": " Literature", "name": "Adv St. Lit Theory", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["Y", "", "G. Holtz", [["NF 008", ["M", 10, 12]]]]}, "SC": "S", "CR": 0.5, "course_code": "FRE446H1", "SEM": 24}, "SMC399Y1": {"course_description": "<p>An independent research project to be proposed by the student and supervised by a full-time faculty member affiliated with the Book and Media Studies Program. Not eligible for CR/NCR option.\r\nPrerequisite:\r\n                    <a href=\"crs_smc.htm#SMC219Y1\">SMC219Y1</a>; <a href=\"crs_smc.htm#SMC228H1\">SMC228H1</a>;<a href=\"crs_smc.htm#SMC229H1\">SMC229H1</a>; enrolment in the Major program; approval of Program DirectorDistribution Requirement Status:  This is a Humanities courseBreadth Requirement:  None\r\n", "LEC": -1, "course_name": "Independent Study in Book and Media Studies", "name": "Independent Stud B", "TUT": -1, "PRA": -1, "wintersections": {"L0101": ["N", "E", "Staff", [["", "TBA"]], "", "9999"]}, "SC": "Y", "CR": 1, "course_code": "SMC399Y1", "SEM": -1}, "LIN398H0": {"course_description": "<p>An instructor-supervised group project in an off-campus setting. Details at <a href=\"http://www.artsci.utoronto.ca/current/course/399\">http://www.artsci.utoronto.ca/current/course/399</a>. Not eligible for CR/NCR option.\r\nDistribution Requirement Status:  This is a Humanities courseBreadth Requirement:  None\r\n", "LEC": 0, "course_name": "Research Excursions", "TUT": 0, "PRA": 0, "CR": 0.5, "course_code": "LIN398H0", "SEM": 0}, "DTS390H1": {"course_description": "<p>A scholarly project chosen by the student, approved by the Department, and supervised by one of its instructors. Consult with the Diaspora and Transnational Studies Program Office for more information. Not eligible for CR/NCR option.\r\nPrerequisite:\r\n                    <a href=\"crs_dts.htm#DTS200Y1\">DTS200Y1</a>Distribution Requirement Status:  This is a Humanities or Social Science courseBreadth Requirement:  None\r\n", "LEC": -1, "course_name": "Independent Study", "name": "Independent Study", "TUT": -1, "PRA": -1, "wintersections": {"L0101": ["N", "E", "Staff", [["", "TBA"]], "", "9999"]}, "SC": "S", "CR": 0.5, "course_code": "DTS390H1", "SEM": -1}, "CRI387H1": {"course_description": "\r\n                    <p>Moral regulation through criminal law, and the role of legal texts and procedures in promoting certain values while marginalizing others. The decriminalization of homosexuality and abortion, the censorship of pornography, the key role of administrative law mechanisms, and the transformation from direct to indirect forms of regulation.\r\n                    \r\n                    <img src=\"../gifs/new.gif\" width=\"28\" height=\"11\" alt=\"NEW\">Prerequisite:\r\n(<a href=\"crs_cri.htm#CRI205H1\">CRI205H1</a>/WDW205H1/WDW200Y),  (<a href=\"crs_cri.htm#CRI225H1\">CRI225H1</a>/WDW225H1/WDW220Y)\r\n<img src=\"../gifs/new.gif\" width=\"28\" height=\"11\" alt=\"NEW\">Co-requisite:<a href=\"crs_cri.htm#CRI210H1\">CRI210H1</a>/WDW210H1/WDW200Y\r\nExclusion:\r\n                    WDW391H1 in 2002, WDW387H1\r\n                    Distribution Requirement Status:  This is a Social Science course\r\n                    Breadth Requirement:  Society and its Institutions (3)\r\n                    ", "LEC": 36, "course_name": "Legal Regulation of Morality (formerly WDW387H1)", "name": "Legal Regulation", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["Y", "R", "M. Valverde", [["BL 205", ["T", 13, 16]]]]}, "SC": "S", "CR": 0.5, "course_code": "CRI387H1", "SEM": 0}, "IRE240H1": {"course_description": "<p>An introduction to the study of the world of work and employment, the history and development of employment relations, its central theories and concepts; the behaviours, outcomes, practices and institutions that emerge from or affect the employment relationship; contemporary issues and comparative employment relations systems.\r\nPrerequisite:\r\n                    Enrolment in the Employment Relations subject posts (ASSPE/ASMAJ1535) or 4.0 FCEs and a minimum cgpa of 2.3. Exclusion:\r\n                    <a href=\"crs_wdw.htm#WDW240H1\">WDW240H1</a>Distribution Requirement Status:  This is a Social Science courseBreadth Requirement:  Society and its Institutions (3)\r\n", "LEC": 36, "course_name": "Introduction to Employment Relations (formerly WDW240H1)", "name": "Intro Employment Rel", "TUT": 0, "PRA": 0, "wintersections": {"L5101": ["Y", "R", "R. Gomez", [["WW 126", ["W", 18, 21]]], "", "60"]}, "SC": "F", "CR": 0.5, "course_code": "IRE240H1", "SEM": 0}, "CLA371H1": {"course_description": "<p>Topics vary from year to year.\r\nPrerequisite:\r\n                    <a href=\"crs_cla.htm#CLA160H1\">CLA160H1</a> + 1 of <a href=\"crs_cla.htm#CLA231H1\">CLA231H1</a>/<a href=\"crs_cla.htm#CLA260H1\">CLA260H1</a>Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Society and its Institutions (3)\r\n", "LEC": 0, "course_name": "Topics in the Study of Roman History", "TUT": 0, "PRA": 0, "CR": 0.5, "course_code": "CLA371H1", "SEM": 36}, "DRM301H1": {"course_description": "<p>Builds on skills learned in <a href=\"crs_drm.htm#DRM201H1\">DRM201H1</a> (Intro to Voice) as they relate to the development of acting abilities. The course investigates the relationship between theory and physical practice of voice training. Taken in conjunction with <a href=\"crs_drm.htm#DRM300Y1\">DRM300Y1</a>: Performance I and <a href=\"crs_drm.htm#DRM311H1\">DRM311H1</a>: Movement for the Actor I.\r\nPrerequisite:\r\n                    <a href=\"crs_drm.htm#DRM200Y1\">DRM200Y1</a>, <a href=\"crs_drm.htm#DRM201H1\">DRM201H1</a>, <a href=\"crs_drm.htm#DRM211H1\">DRM211H1</a> (previously DRM201Y1)Corequisite:\r\n                    <a href=\"crs_drm.htm#DRM300Y1\">DRM300Y1</a> and <a href=\"crs_drm.htm#DRM311H1\">DRM311H1</a>Exclusion:\r\n                    DRM301Y1Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 0, "course_name": "Voice for the Actor I", "name": "Voice I", "TUT": 3, "PRA": 48, "wintersections": {"L0101": ["N", "E", "C. Block", [["UP 109", ["R", 9, 11]]]], "L0201": ["N", "E", "C. Block", [["UP 109", ["R", 11, 13]]]]}, "SC": "Y", "CR": 0.5, "course_code": "DRM301H1", "SEM": 0}, "RLG470H1": {"course_description": "<p class=\"MsoNormal\">A study of Tantric Buddhism, addressing ritual and scholastic practices, and problems of translation and interpretation. Themes will vary by year; consult the departmental website for this years course description.\r\nPrerequisite:\r\n                    Instructorâ€™s permission required for admission to course.Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Thought, Belief and Behaviour (2)\r\n", "LEC": 24, "course_name": "Buddhist Tantra", "TUT": 0, "PRA": 0, "CR": 0.5, "course_code": "RLG470H1", "SEM": 0}, "CIN301Y1": {"course_description": "<p>Examines film theory and practice from the 1950s onward, and the impact of media change on earlier film cultures and aesthetics. Topics include: New Wave cinemas, the politicization of theory, spectatorship, counter-cinemas, transnational film and Global Hollywood, and media theory from the analog to the digital.\r\nPrerequisite:\r\n                    <a href=\"crs_cin.htm#CIN105Y1\">CIN105Y1</a>, <a href=\"crs_cin.htm#CIN201Y1\">CIN201Y1</a>  Exclusion:\r\n                    INI214Y1, INI314Y1, INI315Y1 Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1) + Thought, Belief and Behaviour (2)", "LEC": 24, "course_name": "Film Cultures II: Politics and Global Media (formerly INI214Y1 Film Theory/ INI314Y1/ INI315Y1) ", "name": "Film Cultures II", "TUT": 24, "PRA": 0, "wintersections": {"L0101": ["Y", "P", "K. Banning", [["IN 112 (note: room change)", ["T", 12, 13]], ["Fall: MP 103\r\n  Winter: IN 112 (note: room change)", ["R", 13, 16]]], "", "120"], "T0102": ["Cancel"], "T0301": ["N", "", "", [["", ["M", 15, 16]]], "", "40"], "T0201": ["N", "", "", [["", ["M", 13, 14]]], "", "40"], "T0101": ["N", "", "", [["", ["M", 12, 13]]], "", "40"]}, "SC": "Y", "CR": 1, "course_code": "CIN301Y1", "SEM": 72}, "CIV515H1": {"course_description": "<p>The concept of dynamic equilibrium and corresponding equation of motion will be introduced. The theoretical solution of a songle degree of freedom system will be derived and the effects of verious types of loads, such as impulse load, sinusoidal load, or random vibration on the structural response will be discussed. To solve dynamic problems of multi-degree of freedom (MDOF) systems, concepts of mass, stiffness, and damping matrix will be introduced, which will be followed by eigen value analysis and modal analysis. The concepts of Fourier Transformation will be introduced, which will be used to interpret dynamic responses of structures or dynamic nature of applied loads. Dynamic experiments of elastic systems will be demonstrated using an educational shaking table.</p><br>Prerequisite:\n                    <a href=\"Course_Descriptions.html#CIV312H1\">CIV312H1</a> and <a href=\"Course_Descriptions.html#CIV313H1\">CIV313H1</a> or equivalent\n", "LEC": 36.0, "course_name": "Introduction to Structural Dynamics", "fallsections": {"TUT0101": ["", "", "Mercan, Oya", [["BA1220", ["T", 14.0, 15.0]]]], "LEC0101": ["", "", "Mercan, Oya", [["BA1240", ["T", 15.0, 16.0]], ["RS208", ["F", 12.0, 14.0]]]]}, "TUT": 12.0, "PRA": 0.0, "SC": ["F"], "CR": 0.5, "course_code": "CIV515H1", "SEM": 0}, "UNI201H1": {"course_description": "<p>Contemporary Qubec from social, economic and political perspectives.\r\nDistribution Requirement Status:  This is a Social Science courseBreadth Requirement:  Society and its Institutions (3)\r\n", "LEC": 0, "course_name": "bec Society", "TUT": 0, "PRA": 0, "CR": 0.5, "course_code": "UNI201H1", "SEM": 24}, "ECO356H1": {"course_description": "<p>Courses may be offered in one or more subjects each year. Students must meet the prerequisites announced by the Department (see the Undergraduate Administrator or the Economics Department website for details).\r\nPrerequisite:\r\n                    TBADistribution Requirement Status:  This is a Social Science courseBreadth Requirement:  Society and its Institutions (3)\r\n", "LEC": 24, "course_name": "Special Topics in Financial Economics", "TUT": 12, "PRA": 0, "CR": 0.5, "course_code": "ECO356H1", "SEM": 0}, "VIC133H1": {"course_description": "<p>This course covers issues in diplomacy and international crisis management from the fall of the Berlin Wall to the present day. The course examines the real world of political decision making. Both Canadian and American policy will be analyzed. Issues to be covered include the collapse of the Soviet Union, military intervention in humanitarian crises, the conflicts in Afghanistan and Iraq, and the impact of globalization.\r\nExclusion:\r\n                    Innis One, Munk One, New One, SMC One, Trinity One, UC One, Vic One, Woodsworth One;  No more than another 0.5 FCE from 199 seminars or Vic One Hundred.Distribution Requirement Status:  This is a Humanities or Social Science courseBreadth Requirement:  Society and its Institutions (3)\r\n", "LEC": 0, "course_name": "Diplomacy and International Crisis Management: 1989 to Today", "TUT": 0, "PRA": 0, "CR": 0.5, "course_code": "VIC133H1", "SEM": 24}, "ECE355H1": {"course_description": "<p>An introduction to continuous-time and discrete-time signals and systems. Topics include characterization of linear time-invariant systems, Fourier analysis, linear filtering, sampling of continuous-time signals, and modulation techniques for communication systems.</p><br>\n", "LEC": 36.0, "course_name": "Signal Analysis and Communication", "fallsections": {"TUT0101": ["", "", "", [["BA2155", ["T", 15.0, 17.0]]]], "TUT0102": ["", "", "", [["BA2145", ["T", 15.0, 17.0]]]], "LEC0101": ["", "", "Khisti, Ashish", [["BA1210", ["M", 16.0, 17.0]], ["BA1210", ["T", 17.0, 18.0]], ["BA1210", ["R", 16.0, 17.0]]]]}, "TUT": 24.0, "PRA": 0.0, "SC": ["F"], "CR": 0.5, "course_code": "ECE355H1", "SEM": 0}, "STA452H1": {"course_description": "<p>Statistical theory and its applications at an advanced mathematical level. Topics include probability and distribution theory as it specifically pertains to the statistical analysis of data. Linear models and the geometry of data, least squares and the connection to conditional expectation. The basic concept of inference and the likelihood function.\r\nPrerequisite:\r\n                    <a href=\"crs_mat.htm#MAT223H1\">MAT223H1</a>/<a href=\"crs_mat.htm#MAT240H1\">MAT240H1</a>; <a href=\"crs_mat.htm#MAT235Y1\">MAT235Y1</a>/<a href=\"crs_mat.htm#MAT237Y1\">MAT237Y1</a>/<a href=\"crs_mat.htm#MAT257Y1\">MAT257Y1</a>; <a href=\"crs_sta.htm#STA257H1\">STA257H1</a>, <a href=\"crs_sta.htm#STA347H1\">STA347H1</a>/<a href=\"crs_sta.htm#STA355H1\">STA355H1</a>. Note:  <a href=\"crs_mat.htm#MAT237Y1\">MAT237Y1</a>/<a href=\"crs_mat.htm#MAT257Y1\">MAT257Y1</a>; (<a href=\"crs_mat.htm#MAT223H1\">MAT223H1</a>, <a href=\"crs_mat.htm#MAT224H1\">MAT224H1</a>)/<a href=\"crs_mat.htm#MAT240H1\">MAT240H1</a> very strongly recommended.Exclusion:\r\n                    STA352Y1Distribution Requirement Status:  This is a Science courseBreadth Requirement:  The Physical and Mathematical Universes (5)\r\n", "LEC": 36, "course_name": "Mathematical Statistics I (formerly STA352Y1)", "name": "Math Statistics I", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["N", "", "D. Brenner", [["SS 1073", ["M", 10, 11], ["F", 10, 11]], ["SS 2105\r\n    (Note: room change)\r\n  ", ["W", 10, 11]]], "", "55"]}, "SC": "F", "CR": 0.5, "course_code": "STA452H1", "SEM": 0}, "NML320H1": {"course_description": "<p>An intensive study of various Targumim to the Pentateuch: Onkelos, Pseudo-Jonathan, Neophyti, Samaritan and Fragment Targumim. Differences among them in vocabulary, syntax and verb usage are discussed, as well as their relationship to the Palestinian midrashim. (Offered in alternate years)\r\nPrerequisite:\r\n                    <a href=\"crs_nmc.htm#NML220Y1\">NML220Y1</a>Exclusion:\r\n                    NMC415Y1/NMC415H1Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 0, "course_name": "Intermediate Aramaic: Targum ", "name": "Intermed Aramaic", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["Y", "", "T. Meacham", [["BF 200", ["M", 12, 15]]], "", "5"]}, "SC": "F", "CR": 0.5, "course_code": "NML320H1", "SEM": 24}, "STA410H1": {"course_description": "<p>Programming in an interactive statistical environment. Generating random variates and evaluating statistical methods by simulation. Algorithms for linear models, maximum likelihood estimation, and Bayesian inference. Statistical algorithms such as the Kalman filter and the EM algorithm. Graphical display of data.</p><br>Prerequisite:\n                    <a href=\"Course_Descriptions.html#STA302H1\">STA302H1</a>, <a href=\"Course_Descriptions.html#CSC108H1\">CSC108H1</a>/<a href=\"Course_Descriptions.html#CSC120H1\">CSC120H1</a>/<a href=\"Course_Descriptions.html#CSC148H1\">CSC148H1</a>\n", "LEC": 36.0, "course_name": "Statistical Computation", "fallsections": {"LEC2001": ["", "", "", [["SS1085", ["W", 11.0, 12.0]], ["SS1085", ["R", 13.0, 15.0]]]]}, "TUT": 0.0, "PRA": 0.0, "SC": ["F"], "CR": 0.5, "course_code": "STA410H1", "SEM": 0}, "BME344H1": {"course_description": "<p>Introduction to modeling of physiological control systems present in the human body, combining physiology, linear system modeling and linear control theory. Topics include: representation of physical systems using differential equations and linearization of these dynamic models; graphical representation of the control systems/plants; Laplace transforms; transfer functions; performance of dynamic systems; time and frequency analysis; observability and controllability; and close-loop controller design.</p><br>\n", "LEC": 36.0, "course_name": "Modeling, Dynamics, and Control of Biological Systems", "fallsections": {"TUT0101": ["", "", "", [["WB219", ["T", 11.0, 12.0]]]], "LEC0101": ["", "", "Yoo, Paul", [["GB248", ["T", 10.0, 11.0]], ["GB248", ["W", 10.0, 11.0]], ["BA1220", ["F", 10.0, 11.0]]]]}, "TUT": 12.0, "PRA": 0.0, "SC": ["F"], "CR": 0.5, "course_code": "BME344H1", "SEM": 0}, "NFS284H1": {"course_description": "<p>An introductory course to provide the fundamentals of human nutrition to enable students to understand and think critically about the complex interrelationships between food, nutrition, health and the environment.Recommended Preparation:\r\n                    (<a href=\"crs_eeb.htm#BIO120H1\">BIO120H1</a>, <a href=\"crs_csb.htm#BIO130H1\">BIO130H1</a>)/BIO150Y1; (<a href=\"crs_chm.htm#CHM138H1\">CHM138H1</a>,<a href=\"crs_chm.htm#CHM139H1\">CHM139H1</a>)/<a href=\"crs_chm.htm#CHM151Y1\">CHM151Y1</a>Distribution Requirement Status:  This is a Science courseBreadth Requirement:  Living Things and Their Environment (4)\r\n", "LEC": 36, "course_name": "Basic Human Nutrition", "name": "Basic Human Nutrition", "TUT": 12, "PRA": 0, "wintersections": {"T0901": ["N", "", "", [["", ["W", 15, 16]]], "", "26"], "T0201": ["N", "", "", [["", ["T", 13, 14]]], "", "26"], "T1001": ["N", "", "", [["", ["W", 16, 17]]], "", "26"], "T1501": ["N", "", "", [["", ["F", 11, 12]]], "", "26"], "T0601": ["N", "", "", [["", ["W", 11, 12]]], "", "26"], "T1601": ["N", "", "", [["", ["F", 12, 13]]], "", "26"], "T0301": ["N", "", "", [["", ["T", 14, 15]]], "", "26"], "T1101": ["N", "", "", [["", ["R", 11, 12]]], "", "26"], "T0701": ["N", "", "", [["", ["W", 13, 14]]], "", "26"], "T1301": ["N", "", "", [["", ["R", 13, 14]]], "", "26"], "L0101": ["Y", "P", "Hartman/Gurfinkel", [["MC 102", ["M", 11, 13]], ["ES 1050", ["W", 12, 13]]], "", "468"], "T0401": ["N", "", "", [["", ["T", 15, 16]]], "", "26"], "T1201": ["N", "", "", [["", ["R", 12, 13]]], "", "26"], "T0801": ["N", "", "", [["", ["W", 14, 15]]], "", "26"], "T0101": ["N", "", "", [["", ["T", 12, 13]]], "", "26"], "T1401": ["N", "", "", [["", ["R", 14, 15]]], "", "26"], "T0501": ["N", "", "", [["", ["W", 10, 11]]], "", "26"]}, "SC": "S", "CR": 0.5, "course_code": "NFS284H1", "SEM": 0}, "LIN232H1": {"course_description": "<p>The nature and organization of syntactic systems; their relation to semantic systems and the linguistic organization of discourse; practical work in analysis.\r\nPrerequisite:\r\n                    <a href=\"crs_lin.htm#LIN100Y1\">LIN100Y1</a>Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Thought, Belief and Behaviour (2)\r\n", "LEC": 24, "course_name": "Syntactic Patterns in Language", "name": "Syntactic Patterns", "TUT": 12, "PRA": 0, "wintersections": {"T0101": ["N", "", "", [["", ["W", 16, 17]]], "", "38"], "T5101": ["N", "", "", [["", ["W", 17, 18]]], "", "37"], "L5101": ["Y", "P", "A. Motut", [["SS 2118", ["M", 19, 21]]], "", "112"], "T5201": ["N", "", "", [["", ["W", 18, 19]]], "", "37"]}, "SC": "F", "CR": 0.5, "course_code": "LIN232H1", "SEM": 0}, "ANT468H1": {"course_description": "<p>Since first contact in the mid-20th Century, Highlands ethnographies have played a central role in debates about kinship, systems of exchange and relations between the sexes in small scale societies. The course examines traditional warfare, sorcery, rites of passage, myths and ideologies of conception and the person.\r\nPrerequisite:\r\n                    <a href=\"crs_ant.htm#ANT207H1\">ANT207H1</a>Distribution Requirement Status:  This is a Social Science courseBreadth Requirement:  Society and its Institutions (3)\r\n", "LEC": 0, "course_name": "Ethnography of the Papua New Guinea Highlands", "TUT": 0, "PRA": 0, "CR": 0.5, "course_code": "ANT468H1", "SEM": 24}, "ECO364H1": {"course_description": "<p>An examination of the causes and consequences of international trade. The first half develops traditional models of comparative advantage, with the second half examines more recent theoretical and empirical work on trade  wages, the political economy of trade, outsourcing, and firm heterogeneity.\r\nPrerequisite:\r\n                    <a href=\"crs_eco.htm#ECO200Y1\">ECO200Y1</a>/<a href=\"crs_eco.htm#ECO204Y1\">ECO204Y1</a>/<a href=\"crs_eco.htm#ECO206Y1\">ECO206Y1</a>, <a href=\"crs_eco.htm#ECO220Y1\">ECO220Y1</a>/<a href=\"crs_eco.htm#ECO227Y1\">ECO227Y1</a>/(<a href=\"crs_sta.htm#STA220H1\">STA220H1</a>,<a href=\"crs_sta.htm#STA255H1\">STA255H1</a>)/(<a href=\"crs_sta.htm#STA257H1\">STA257H1</a>,<a href=\"crs_sta.htm#STA261H1\">STA261H1</a>)Exclusion:\r\n                    <a href=\"crs_eco.htm#ECO230Y1\">ECO230Y1</a>/ECO328Y1Distribution Requirement Status:  This is a Social Science courseBreadth Requirement:  Society and its Institutions (3)\r\n", "LEC": 24, "course_name": "International Trade Theory", "name": "International Trade", "TUT": 12, "PRA": 0, "wintersections": {"L0101": ["Y", "P", "A.Stoyanov", [["MP 103", ["M", 14, 17]]], "", "150"], "L5101": ["Y", "P", "A.Stoyanov", [["SS 2102", ["M", 18, 21]]]]}, "SC": "S", "CR": 0.5, "course_code": "ECO364H1", "SEM": 0}, "ENG393H1": {"course_description": "<p>A project in creative writing chosen by the student and supervised by a member of the staff. The form of the project and the manner of its execution are determined in consultation with the supervisor. All project proposals should be submitted by May 15. Proposal forms are available online and from the Department. Not eligible for CR/NCR option.\r\nPrerequisite:\r\n                    3.0 ENG FCE, including <a href=\"crs_eng.htm#ENG389Y1\">ENG389Y1</a>, any 4.0 FCE and permission of the instructor and the Associate ChairExclusion:\r\n                    <a href=\"crs_eng.htm#ENG391Y1\">ENG391Y1</a>Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  None\r\n", "LEC": -1, "course_name": "Individual Studies (Creative)", "name": "Indiv Stud (Creative)", "TUT": -1, "PRA": -1, "wintersections": {"L0101": ["N", "E", "Staff", [["", "TBA"]], "", "9999"]}, "SC": "S", "CR": 0.5, "course_code": "ENG393H1", "SEM": -1}, "AST210H1": {"course_description": "<p>From the Copernican Revolution to twentieth century astrophysics. Emphasis is placed on the process of discovery which has led to major advances in knowledge about the Universe. The course includes an outline of some of the most significant puzzles of our day and an examination of the potential for new revolutions in our knowledge. This course is best suited to science students.\r\nExclusion:\r\n                    <a href=\"crs_ast.htm#AST101H1\">AST101H1</a>, <a href=\"crs_ast.htm#AST121H1\">AST121H1</a>, <a href=\"crs_ast.htm#AST201H1\">AST201H1</a>Distribution Requirement Status:  This is a Science courseBreadth Requirement:  The Physical and Mathematical Universes (5)\r\n", "LEC": 24, "course_name": "Great Moments in Astronomy", "name": "Great Moments in Ast", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["Y", "", "S. Mochnacki ", [["WB 116", ["M", 11, 12], ["W", 11, 12]]], "", "240"]}, "SC": "F", "CR": 0.5, "course_code": "AST210H1", "SEM": 0}, "LAT351H1": {"course_description": "<p>Readings from Latin comedy and/or tragedy.\r\nPrerequisite:\r\n                    <a href=\"crs_cla.htm#LAT202H1\">LAT202H1</a>Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 0, "course_name": "Latin Drama I ", "TUT": 0, "PRA": 0, "CR": 0.5, "course_code": "LAT351H1", "SEM": 36}, "HMB401H1": {"course_description": "<p>This course introduces life science students to the application of patent law in medicine. Patents covering drugs, medical device implants, diagnostics and medical device software including medical smartphone apps, will be discussed. Key emphasis will also be given to the limitations of patent protection in commercializing medical products.\r\nPrerequisite:\r\n                    4th year status; <a href=\"crs_hmb.htm#HMB301H1\">HMB301H1</a>/BIO375H5Distribution Requirement Status:  This is a Science courseBreadth Requirement:  Living Things and Their Environment (4)\r\n", "LEC": 24, "course_name": "Patents in Medicine", "name": "Patents in Medicine", "TUT": 12, "PRA": 0, "wintersections": {"L0101": ["Y", "AE", "J. Parker", [["SS 2108", ["M", 14, 16]]]]}, "SC": "S", "CR": 0.5, "course_code": "HMB401H1", "SEM": 0}, "ECO320H1": {"course_description": "<p>The practical application of microeconomic theory to common legal problems: torts, contracts, property and crime, and the limitations of economic analysis. No previous familiarity with the law is assumed. (This is an economic analysis of legal issues, not a course in law.)\r\nPrerequisite:\r\n                    <a href=\"crs_eco.htm#ECO200Y1\">ECO200Y1</a>/<a href=\"crs_eco.htm#ECO204Y1\">ECO204Y1</a>/<a href=\"crs_eco.htm#ECO206Y1\">ECO206Y1</a>Distribution Requirement Status:  This is a Social Science courseBreadth Requirement:  Society and its Institutions (3)\r\n", "LEC": 24, "course_name": "Economic Analysis of Law", "name": "Eco Anlysis of Law", "TUT": 12, "PRA": 0, "wintersections": {"L0101": ["Y", "P", "D. Dewees", [["Contact Department for Information", ["M", 16, 17]], ["SS 2117\r\n  (Note: room change)", ["W", 14, 16]]], "", "120"]}, "SC": "F", "CR": 0.5, "course_code": "ECO320H1", "SEM": 0}, "VIC278H1": {"course_description": "<p>Models frame our understanding and treatment of illness and are the most fundamental element of the scientific method. Theology, history, and literature may use models in different ways than natural and medical sciences but fundamentally all modelling is an attempt to accurately predict and manipulate the future.\r\nDistribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Thought, Belief and Behaviour (2)", "LEC": 0, "course_name": "Modelling Evil and Disease ", "name": "Model Evil & Disease", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["Y", "R", "Baines/Baigrie", [["VC 304", ["M", 10, 12]]]]}, "SC": "Y", "CR": 0.5, "course_code": "VIC278H1", "SEM": 24}, "NML461H1": {"course_description": "<p>This course surveys the development and establishment of modern Persian poetry. The main part of the discussion focuses on the pioneers of modern Persian poetry. Through their biographies and reviewing their selected works, we will discuss the poetic elements, style, figure of speech, theme, motif and other literary details in their works.\r\nPrerequisite:\r\n                    <a href=\"crs_nmc.htm#NML360Y1\">NML360Y1</a> or adequate reading knowledge Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 0, "course_name": "Modern Persian Poetry ", "name": "Modern Persian Poetry", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["Y", "", "A. Taleghani", [["AP 120", ["T", 13, 16]]]]}, "SC": "S", "CR": 0.5, "course_code": "NML461H1", "SEM": 24}, "PSL372H1": {"course_description": "<p>A laboratory course covering selected topics in physiology.\r\nPrerequisite:\r\n                    <a href=\"crs_csb.htm#BIO230H1\">BIO230H1</a>/(BIO240H1, BIO241H1), <a href=\"crs_bch.htm#BCH210H1\">BCH210H1</a>/<a href=\"crs_bch.htm#BCH242Y1\">BCH242Y1</a>, MAT100-series/PHY100-series, <a href=\"crs_psl.htm#PSL300H1\">PSL300H1</a> Corequisite:\r\n                    <a href=\"crs_bch.htm#BCH370H1\">BCH370H1</a> (recommended) Distribution Requirement Status:  This is a Science courseBreadth Requirement:  Living Things and Their Environment (4)\r\n", "LEC": 12, "course_name": "Mammalian Physiology Laboratory", "name": "Physiology Lab", "TUT": 0, "PRA": 36, "wintersections": {"L0101": ["Y\r\n  (note: WL change)\r\n", "AE", "N. Kee", [["BA 1130", ["R", 14, 15]], ["MS Teaching Labs", ["F", 9, 13]]], "", "162"]}, "SC": "F", "CR": 0.5, "course_code": "PSL372H1", "SEM": 0}, "APS163H1": {"course_description": "<p>This online-only course focuses on the fundamental tools of calculus and its connections to engineering. The topics include methods of integration, an introduction to differential equations, series and Taylor series, vector differentiation, and partial differentiation. Problems combining calculus with geometry, linear algebra, statics, and mechanics will be examined.</p><br>Prerequisite:\n                    <a href=\"Course_Descriptions.html#APS162H1\">APS162H1</a>/<a href=\"Course_Descriptions.html#MAT186H1\">MAT186H1</a>Exclusion:\n                    <a href=\"Course_Descriptions.html#MAT187H1\">MAT187H1</a>/<a href=\"Course_Descriptions.html#MAT197H1\">MAT197H1</a>Available Online:\n                    consult Faculty or Graduate Unit for details\n", "LEC": 0.0, "course_name": "Calculus for Engineers II", "TUT": 0.0, "PRA": 0.0, "SC": ["F", "S"], "CR": 0.5, "course_code": "APS163H1", "SEM": 0}, "ENG234H1": {"course_description": "<p>A critical and historical study of poetry and fiction written for or appropriated by children, this course may also include drama or non-fiction and will cover works by at least twelve authors such as Bunyan, Stevenson, Carroll, Twain, Alcott, Nesbit, Montgomery, Milne, Norton, Fitzhugh.\r\nPrerequisite:\r\n                    1.0 ENG FCE or any 4.0 FCEDistribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 36, "course_name": "Children's Literature", "name": "Children's Lit", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["Y", "P", "D. Baker", [["EM 119", ["T", 11, 13]], ["EM 001", ["R", 11, 12]]], "", "120"]}, "SC": "S", "CR": 0.5, "course_code": "ENG234H1", "SEM": 0}, "CIN470H1": {"course_description": "<p>See course description for <a href=\"crs_cin.htm#CIN472H1\">CIN472H1</a> listed below.\r\nPrerequisite:\r\n                    At least ten full-course equivalents, including <a href=\"crs_cin.htm#CIN105Y1\">CIN105Y1</a>, <a href=\"crs_cin.htm#CIN201Y1\">CIN201Y1</a>, <a href=\"crs_cin.htm#CIN301Y1\">CIN301Y1</a>/ permission of instructor Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 0, "course_name": "Advanced Study in History and Nation (formerly INI469H1) ", "name": "Adv Hist & Nation\r\n      (Debating Transnational Cinema) ", "TUT": 0, "PRA": 24, "wintersections": {"L0101": ["Y", "E", "K. Banning", [["IN 223", ["M", 13, 17]]], "", "20"]}, "SC": "F", "CR": 0.5, "course_code": "CIN470H1", "SEM": 24}, "FRE274H1": {"course_description": "<p>An analytical study of contemporary French phonetics and phonology, morphology, syntax and semantics. This course is designed to prepare students for more advanced study of French linguistics at the 300 and 400 levels.\r\nPrerequisite:\r\n                    <a href=\"crs_fre.htm#FRE272H1\">FRE272H1</a>Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Thought, Belief and Behaviour (2)\r\n", "LEC": 24, "course_name": "Introduction to the Linguistic Analysis of French", "name": "Intro Ling Analys Fr", "TUT": 12, "PRA": 0, "wintersections": {"L0101": ["Y", "P", "A. Villeneuve", [["CR 103", ["R", 10, 12]]]], "T0201": ["N", "", "", [["AH 306 (note: room change)", ["T", 16, 17]]]], "T0101": ["N", "", "", [["AH 306 (note: room change)", ["T", 15, 16]]]]}, "SC": "S", "CR": 0.5, "course_code": "FRE274H1", "SEM": 0}, "SLA109Y1": {"course_description": "<p>The basic features of the grammar of the Macedonian literary language. Acquisition of essential vocabulary for practical conversation and for comprehension. Development of reading and writing skills. Open only to students with little or no knowledge of the literary language. (Offered in alternate years).\r\nDistribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 0, "course_name": "Elementary Macedonian", "name": "Elem Macedonian", "TUT": 0, "PRA": 96, "wintersections": {"L0101": ["Y", "", "C. Kramer", [["AH 206", ["M", 14, 16], ["W", 14, 16]]], "", "30"]}, "SC": "Y", "CR": 1, "course_code": "SLA109Y1", "SEM": 0}, "BCH210H1": {"course_description": "<p>Proteins, enzymes, membranes and the metabolism of carbohydrates and lipids. This course is intended for students who are NOT taking <a href=\"Course_Descriptions.html#BCH242Y1\">BCH242Y1</a> as part of their program.</p><br>Prerequisite:\n                    Successful completion of (<a href=\"Course_Descriptions.html#CHM138H1\">CHM138H1</a>, <a href=\"Course_Descriptions.html#CHM139H1\">CHM139H1</a>)/<a href=\"Course_Descriptions.html#CHM151Y1\">CHM151Y1</a> NOTE: CHM1** WITH COURSE EXCLUSION TO <a href=\"Course_Descriptions.html#CHM138H1\">CHM138H1</a> AND <a href=\"Course_Descriptions.html#CHM139H1\">CHM139H1</a> meet the Prerequisite requirement for <a href=\"Course_Descriptions.html#BCH210H1\">BCH210H1</a>. SCI1** DOES NOT COUNT as a Prerequisite. CHM140Y5 (UTM) is equivalent to CMH139H1 ONLY. CHMA10H3 & CHMA11H3 (UTSC) are equivalent to <a href=\"Course_Descriptions.html#CHM139H1\">CHM139H1</a> ONLY. CHMB41H3/CHMB42H3 (UTSC) are equivalent to <a href=\"Course_Descriptions.html#CHM138H1\">CHM138H1</a> ONLY. Students that have a SDF in <a href=\"Course_Descriptions.html#CHM138H1\">CHM138H1</a>/<a href=\"Course_Descriptions.html#CHM139H1\">CHM139H1</a> are not permitted to enrol in <a href=\"Course_Descriptions.html#BCH210H1\">BCH210H1</a> until a final passing grade (50%) appears on the transcript.\r\nExclusion:\n                    <a href=\"Course_Descriptions.html#BCH242Y1\">BCH242Y1</a>,CHM265H5(UTM)/CHM361H5(UTM)/CHM362H5(UTM)/ BGYC12H3 (UTSC) and BGYC13H3 (UTSC)\r\n\n", "LEC": 36.0, "course_name": "Biochemistry I: Proteins, Lipids and Metabolism", "fallsections": {"TUT0101": ["", "", "", [["BI131", ["R", 11.0, 13.0]]]], "TUT0102": ["", "", "", [["CH---", ["F", 11.0, 13.0]]]], "LEC0101": ["", "", "", [["CH---", ["T", 10.0, 11.0]], ["CH---", ["R", 10.0, 11.0]], ["CH---", ["F", 10.0, 11.0]]]]}, "TUT": 24.0, "PRA": 0.0, "SC": ["F"], "CR": 0.5, "course_code": "BCH210H1", "SEM": 0}, "HPS318H1": {"course_description": "<p>This course explores how medicine was practiced, taught and theorized from ancient Greece to the early modern period. It focuses on the historical development of western medicine in relation to societies, politics and culture, and considers topics such as the creation of medical traditions, the tranmission and communication of medical knowledge, the pluralistic world of healers, the role of religion, magic and natural philosophy, the cultural meaning of disease, and the emergence of institutions such as the hospital.\r\nExclusion:\r\n                    HPS314Y1Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Society and its Institutions (3)\r\n", "LEC": 24, "course_name": "History of Medicine I", "name": "History of Medicine I", "TUT": 12, "PRA": 0, "wintersections": {"T0201": ["N", "", "", [["", ["T", 15, 16]]], "", "35"], "T0301": ["N", "", "", [["", ["W", 13, 14]]], "", "35"], "T0401": ["N", "", "", [["", ["W", 14, 15]]], "", "35"], "L5101": ["Y", "", "J.Fraser", [["EM 001", ["T", 18, 20]]], "", "164"], "T0101": ["N", "", "", [["", ["T", 14, 15]]], "", "35"], "T0501": ["N", "", "", [["", ["T", 16, 17]]], "", "30"]}, "SC": "F", "CR": 0.5, "course_code": "HPS318H1", "SEM": 0}, "NML358H1": {"course_description": "<p>Introduction to Mishnah and Tosefta, two of the three foundational documents of Middle Hebrew. In addition to studying specific features of this level of Hebrew, examining these compositions independently, and analyzing their interaction, students will examine current scholarly literature on these documents and their relationship to each other. (Offered in alternate years)\r\nPrerequisite:\r\n                    Intermediate Hebrew (Modern or Biblical)Exclusion:\r\n                    NMC331H1Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 0, "course_name": "Mishnah and Tosefta ", "TUT": 0, "PRA": 0, "CR": 0.5, "course_code": "NML358H1", "SEM": 24}, "PSY336H1": {"course_description": "<p>A review of the field of positive psychology, which is the study of fulfillment and personal growth. The focus is on empirical research regarding the development of healthy, productive, and resilient individuals. Topics include: subjective well-being, optimism, flow experiences, self-control and emotional intelligence, social support and empathy.\r\nPrerequisite:\r\n                    <a href=\"crs_psy.htm#PSY201H1\">PSY201H1</a> (or equivalent), <a href=\"crs_psy.htm#PSY220H1\">PSY220H1</a>/<a href=\"crs_psy.htm#PSY230H1\">PSY230H1</a>/<a href=\"crs_psy.htm#PSY240H1\">PSY240H1</a>Distribution Requirement Status:  This is a Science courseBreadth Requirement:  Thought, Belief and Behaviour (2)\r\n", "LEC": 36, "course_name": "Positive Psychology", "name": "Positive Psychology", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["Y", "P", "D. Dolderman", [["SS 2110", ["T", 14, 17]]], "", "60"], "L5101": ["Y", "P", "C. Burton", [["SS 2106", ["R", 18, 21]]], "", "60"]}, "SC": "S", "CR": 0.5, "course_code": "PSY336H1", "SEM": 0}, "APS104H1": {"course_description": "<p>This is an introductory course in materials science and physical chemistry. Topics include: fundamentals of atomic, structure, the nature of bonding, crystal structure and defects, the laws of chemical thermodynamics (including a discussion of enthalpy and entropy), reaction equilibrium, and phase equilibria. These basic principles provide the foundation for an exploration of structure-property relationships in metals, ceramics, and polymers, with emphasis on mechanical properties.</p><br>\n", "LEC": 36.0, "course_name": "Introduction to Materials and Chemistry", "TUT": 12.0, "PRA": 6.0, "wintersections": {"TUT0107": ["", "", "", [["BA2175", ["T", 14.0, 15.0]]]], "PRA0111": ["", "", "", [["GB405", ["T", 18.0, 20.0]]]], "TUT0101": ["", "", "", [["BA2185", ["F", 13.0, 14.0]]]], "TUT0103": ["", "", "", [["WB130", ["F", 13.0, 14.0]]]], "TUT0102": ["", "", "", [["BA1230", ["F", 13.0, 14.0]]]], "PRA0112": ["", "", "", [["GB405", ["T", 18.0, 20.0]]]], "TUT0104": ["", "", "", [["BA2165", ["F", 13.0, 14.0]]]], "PRA0110": ["", "", "", [["SF3201", ["T", 18.0, 20.0]]]], "TUT0106": ["", "", "", [["BA2175", ["F", 13.0, 14.0]]]], "TUT0109": ["", "", "", [["BA2195", ["T", 14.0, 15.0]]]], "TUT0108": ["", "", "", [["BA2185", ["T", 14.0, 15.0]]]], "LEC0104": ["", "", "Nogami, Jun", [["MC252", ["W", 11.0, 12.0]], ["MC252", ["M", 11.0, 12.0]], ["SF3202", ["R", 11.0, 12.0]]]], "LEC0102": ["", "", "Chin, Cathy Ya Huei", [["BA1160", ["T", 11.0, 12.0]], ["BA1160", ["R", 10.0, 11.0]], ["BA1160", ["M", 10.0, 11.0]]]], "LEC0103": ["", "", "Mirkovic, Tihana", [["BA1180", ["M", 10.0, 11.0]], ["BA1180", ["T", 11.0, 12.0]], ["BA1180", ["R", 10.0, 11.0]]]], "LEC0101": ["", "", "Azimi, Gisele", [["BA1190", ["M", 10.0, 11.0]], ["BA1190", ["T", 11.0, 12.0]], ["BA1190", ["R", 10.0, 11.0]]]], "TUT0112": ["", "", "", [["BA2165", ["T", 14.0, 15.0]]]], "TUT0110": ["", "", "", [["BA2145", ["T", 14.0, 15.0]]]], "TUT0111": ["", "", "", [["BA2155", ["T", 14.0, 15.0]]]], "PRA0109": ["", "", "", [["SF3201", ["T", 18.0, 20.0]]]], "PRA0108": ["", "", "", [["GB412", ["T", 18.0, 20.0]]]], "PRA0101": ["", "", "", [["HA403", ["T", 18.0, 20.0]]]], "PRA0103": ["", "", "", [["GB404", ["T", 18.0, 20.0]]]], "PRA0102": ["", "", "", [["HA403", ["T", 18.0, 20.0]]]], "PRA0105": ["", "", "", [["GB304", ["T", 18.0, 20.0]]]], "PRA0104": ["", "", "", [["GB404", ["T", 18.0, 20.0]]]], "PRA0107": ["", "", "", [["GB412", ["T", 18.0, 20.0]]]], "PRA0106": ["", "", "", [["GB304", ["T", 18.0, 20.0]]]], "TUT0105": ["", "", "", [["BA1210", ["F", 13.0, 14.0]]]]}, "SC": ["S"], "CR": 0.5, "course_code": "APS104H1", "SEM": 0}, "PHL499H1": {"course_description": "<p>Individual Studies. Not eligible for CR/NCR option.\r\nDistribution Requirement Status:  This is a Humanities courseBreadth Requirement:  None\r\n", "LEC": -1, "course_name": "Individual Studies (formerly PHL399H1)", "name": "Individual Studies", "TUT": -1, "PRA": -1, "wintersections": {"L0101": ["N", "E", "", [["", "TBA"]], "", "9999"]}, "SC": "Y", "CR": 0.5, "course_code": "PHL499H1", "SEM": -1}, "DRM411H1": {"course_description": "<p>The final year of movement training refines the skills and concepts developed thus far, focusing on performance. Techniques of folk, period and social dance are studied. Taken in conjunction with <a href=\"crs_drm.htm#DRM400Y1\">DRM400Y1</a>: Performance II and <a href=\"crs_drm.htm#DRM401H1\">DRM401H1</a>: Voice for the Actor II.\r\nPrerequisite:\r\n                    <a href=\"crs_drm.htm#DRM300Y1\">DRM300Y1</a>, <a href=\"crs_drm.htm#DRM301H1\">DRM301H1</a> and <a href=\"crs_drm.htm#DRM311H1\">DRM311H1</a> Corequisite:\r\n                    <a href=\"crs_drm.htm#DRM400Y1\">DRM400Y1</a> and <a href=\"crs_drm.htm#DRM401H1\">DRM401H1</a>Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 0, "course_name": "Movement for the Actor II ", "name": "Movement II", "TUT": 2, "PRA": 48, "wintersections": {"L0101": ["N", "E", "S. Boye", [["MO 100B", ["T", 10, 12]]]]}, "SC": "Y", "CR": 0.5, "course_code": "DRM411H1", "SEM": 0}, "PHY131H1": {"course_description": "<p>A first university physics course primarily for students not intending to pursue a Specialist or Major program in Physical or Mathematical Sciences. Topics include: classical kinematics  dynamics, momentum, energy, force, friction, work, power, angular momentum, oscillations, fluids, viscosity.\r\nPrerequisite:\r\n                    MCV4U Calculus & Vectors / MHF4U Functions & CalculusCorequisite:\r\n                    <a href=\"crs_mat.htm#MAT135H1\">MAT135H1</a>/<a href=\"crs_mat.htm#MAT137Y1\">MAT137Y1</a>/<a href=\"crs_mat.htm#MAT157Y1\">MAT157Y1</a> Exclusion:\r\n                    <a href=\"crs_phy.htm#PHY151H1\">PHY151H1</a>/PHY110Y1/PHY138Y1/PHY140Y1Recommended Preparation:\r\n                    SPH4U Physics and SCH4U ChemistryDistribution Requirement Status:  This is a Science courseBreadth Requirement:  The Physical and Mathematical Universes (5)\r\n", "LEC": 24, "course_name": "Introduction to Physics I", "name": "Intro Physics I", "TUT": 0, "PRA": 20, "wintersections": {"P0301": ["N", "", "", [["", ["W", 14, 16]]]], "P0401": ["N", "", "", [["", ["R", 10, 12]]], "", "72"], "L0101": ["Y", "P", "Krasnopolskaia/Wilson", [[" MP 102", ["M", 11, 12], ["W", 11, 12]]], "", "1500"], "P0402": ["N", "", "", [["", ["R", 12, 14]]], "", "72"], "P0404": ["N", "", "", [["", ["R", 14, 16]]], "", "72"], "P0501": ["N", "", "", [["", ["F", 10, 12]]], "", "72"], "P0502": ["N", "", "", [["", ["F", 12, 14]]], "", "72"], "P0504": ["N", "", "", [["", ["F", 14, 16]]], "", "72"]}, "SC": "S", "CR": 0.5, "course_code": "PHY131H1", "SEM": 0}, "CIV312H1": {"course_description": "<p>An introduction to structural engineering design. Topics discussed include safety and reliability, load and resistance, probability of failure, performance factors, and material properties. A study of basic steel design examines tension members, compression members, beams, framing concepts and connections. Plasticity and composite action in steel structural systems are also discussed. Timber design aspects include beams, compression members and connections.</p><br>Prerequisite:\n                    <a href=\"Course_Descriptions.html#CIV214H1\">CIV214H1</a>, <a href=\"Course_Descriptions.html#CIV235H1\">CIV235H1</a>.\n", "LEC": 36.0, "course_name": "Steel and Timber Design", "fallsections": {"TUT0101": ["", "", "Christopoulos, Constantin", [["GB405", ["R", 12.0, 14.0]]]], "TUT0102": ["", "", "Christopoulos, Constantin", [["GB404", ["R", 12.0, 14.0]]]], "LEC0101": ["", "", "Christopoulos, Constantin", [["SF1105", ["F", 14.0, 16.0]], ["SF1101", ["W", 16.0, 17.0]]]]}, "TUT": 24.0, "PRA": 0.0, "SC": ["F"], "CR": 0.5, "course_code": "CIV312H1", "SEM": 0}, "SOC301Y1": {"course_description": "<p>Theories of social inequality, its historical evolution, and the determinants of continuity and change of patterns of social inequality.\r\nPrerequisite:\r\n                    A 200+ level SOC courseDistribution Requirement Status:  This is a Social Science courseBreadth Requirement:  Society and its Institutions (3)\r\n", "LEC": 48, "course_name": "Theories of Inequality", "TUT": 0, "PRA": 0, "CR": 1, "course_code": "SOC301Y1", "SEM": 0}, "MIE365H1": {"course_description": "<p>Design of operations research models to solve a variety of open-ended problems. Linear programming extensions are presented: goal programming, column generation, Dantzig-Wolfe decomposition, and interior point solution methods. Non-linear programming solution methods are developed: optimality conditions, quadratic programming and bi-level programming. Solutions to advanced stochastic models: stochastic programming, 2-person and n-person game theory, and Markov Decision Processes.</p><br>Prerequisite:\n                    <a href=\"Course_Descriptions.html#MIE262H1\">MIE262H1</a>, <a href=\"Course_Descriptions.html#MIE263H1\">MIE263H1</a>\n", "LEC": 36.0, "course_name": "Operations Research III: Advanced OR", "fallsections": {"PRA0101": ["", "", "", [["GB144", ["W", 16.0, 18.0]], ["GB150", ["W", 16.0, 18.0]]]], "TUT0101": ["", "", "", [["SF2202", ["F", 15.0, 16.0]]]], "LEC0101": ["", "", "Frances, Daniel", [["BA1220", ["M", 15.0, 16.0]], ["BA1220", ["W", 15.0, 16.0]], ["BA1210", ["M", 9.0, 10.0]]]]}, "TUT": 12.0, "PRA": 24.0, "SC": ["F"], "CR": 0.5, "course_code": "MIE365H1", "SEM": 0}, "MIE422H1": {"course_description": "<p>Introduction to Computer Integrated Manufactuing. Definitions, terminology. Organization of manufacturing systems. Introduction to NC machines. Introduction to robotics. Types of robot motion. Robot kinematics. Jacobians, singularities. Robot motion trajectories. Interpolation, spline fits. Robot joint control. Flexible manufacturing systems, justification. Robot cell design. Group technology. Design of group technology cell. Programmable logic controllers. Limited enrolment.</p><br>Prerequisite:\n                    <a href=\"Course_Descriptions.html#MIE221H1\">MIE221H1</a> or equivalent\n", "LEC": 24.0, "course_name": "Automated Manufacturing", "fallsections": {"PRA0101": ["", "", "", [["MB68", ["W", 15.0, 18.0]]]], "PRA0102": ["", "", "", [["MB68", ["W", 15.0, 18.0]]]], "LEC0101": ["", "", "Mills, James", [["RS208", ["M", 9.0, 10.0]], ["RS208", ["F", 11.0, 12.0]]]]}, "TUT": 0.0, "PRA": 36.0, "SC": ["F"], "CR": 0.5, "course_code": "MIE422H1", "SEM": 0}, "MHB255H1": {"course_description": "<p>Intensive study of written and spoken Hebrew.\r\nPrerequisite:\r\n                    <a href=\"crs_rlg.htm#MHB156H1\">MHB156H1</a>/ <a href=\"crs_nmc.htm#NML156H1\">NML156H1</a> or permission of instructorExclusion:\r\n                    Grade 8 Hebrew (or Ulpan level 2 in Israel)/NML255Y1Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 36, "course_name": "Intermediate Modern Hebrew ", "name": "Inter Modern Hebrew I", "TUT": 12, "PRA": 0, "wintersections": {"L0101": ["Y", "", "Y. Nizri", [["JHB 100A", ["M", 13, 15], ["W", 13, 15]]], "", "10"]}, "SC": "F", "CR": 0.5, "course_code": "MHB255H1", "SEM": 0}, "BME479H1": {"course_description": "<p>A seminar to introduce students to concepts in biomedical systems engineering design in preparation for <a href=\"Course_Descriptions.html#BME489H1\">BME489H1</a> - Biomedical Systems Engineering Design. Review of general design concepts in the context of biodesign practice. Discussion of issues related to biodesign, including regulatory processes, intellectual property, and global health. Students will be introduced to clients, identify a design project, and define their design problem. At the end of the term, students will deliver a draft \"elevator pitch\" for their project.</p><br>\n", "LEC": 0.0, "course_name": "Introduction to Biomedical Systems Engineering Design Concepts", "fallsections": {"TUT0101": ["", "", "Fernandez-Gonzalez, Rodrigo and Andrysek, Jan and Eizenman, Moshe", [["BA2145", ["R", 18.0, 19.0]]]]}, "TUT": 12.0, "PRA": 0.0, "SC": ["F"], "CR": 0.1, "course_code": "BME479H1", "SEM": 0}, "SLA440H1": {"course_description": "<p>Starting with pre-Pushkinian Classicism this course surveys the development of Russian lyric verse (with some excursions also into narrative verse); major topics studied include: Pushkin, Russian Byronism, the Pushkin Pleade, Nekrasovs civic verse; philosophical verse by Tyutchev; Impressionist and Decadent poets. Readings in Russian.\r\nPrerequisite:\r\n                    <a href=\"crs_sla.htm#SLA320Y1\">SLA320Y1</a>/SLA340H1Exclusion:\r\n                    SLA440Y1Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 0, "course_name": "Introduction to Russian 19th Century Poetry (formerly SLA440Y1)", "TUT": 0, "PRA": 0, "CR": 0.5, "course_code": "SLA440H1", "SEM": 24}, "RLG378H1": {"course_description": "<p class=\"MsoNormal\">This course will examine the diversity of Buddhist traditions in the Himalayan region, covering texts, rituals, histories, and personalities relevant to their study, and the methods employed in the field.\r\nPrerequisite:\r\n                    <a href=\"crs_rlg.htm#RLG206Y1\">RLG206Y1</a> or <a href=\"crs_rlg.htm#RLG205Y1\">RLG205Y1</a>Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 24, "course_name": "Himalayan Buddhism", "TUT": 0, "PRA": 0, "CR": 0.5, "course_code": "RLG378H1", "SEM": 0}, "VIC101H1": {"course_description": "<p>This course is a general orientation to conflict theory, and develops a basic understanding of essential conflict resolution principles that will complement the study of conflict theory. The course will examine the differences between conflicts and disputes, the functions and desirability of conflict, and the conditions that facilitate conversion of conflicts from destructive to constructive.\r\nExclusion:\r\n                    VIC101Y1; Innis One, Munk One, New One, SMC One, Trinity One, UC One, Vic One, Woodsworth One;  No more than another 0.5 FCE from 199 seminars or Vic One Hundred.\r\nDistribution Requirement Status:  This is a Social Science courseBreadth Requirement:  Society and its Institutions (3)\r\n", "LEC": 0, "course_name": "Conflict Theory and Practice (formerly VIC101Y1)", "name": "Conflict Theory Prac", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["Y", "RP", "V. Falkenheim", [["BC 20", ["F", 10, 12]]], "", "25"]}, "SC": "S", "CR": 0.5, "course_code": "VIC101H1", "SEM": 24}, "EEB445H1": {"course_description": "<p>The roles of plants in human societies, including modern ethnobotanical research and its methods. Possible topics: plant products, cultural uses and perceptions of plants, folk taxonomy, and scientific plant taxonomy. Students will deliver oral presentations and research and write a major paper, and are encouraged to draw upon experiences in their family and community.\r\nPrerequisite:\r\n                    One or more of <a href=\"crs_eeb.htm#EEB268H1\">EEB268H1</a>, <a href=\"crs_eeb.htm#EEB330H1\">EEB330H1</a>, <a href=\"crs_eeb.htm#EEB331H1\">EEB331H1</a>, <a href=\"crs_eeb.htm#EEB337H1\">EEB337H1</a>, <a href=\"crs_eeb.htm#EEB340H1\">EEB340H1</a> or permission of department. Distribution Requirement Status:  This is a Science courseBreadth Requirement:  Living Things and Their Environment (4)\r\n", "LEC": 12, "course_name": "Ethnobotany", "name": "Ethnobotany", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["Y", "", "T. Dickinson", [["RO 2B05E", ["W", 14, 17]]]]}, "SC": "S", "CR": 0.5, "course_code": "EEB445H1", "SEM": 24}, "PHC489Y1": {"course_description": "Breadth Requirement:  Society and its Institutions (3)</p>\r\n<p>\r\n<p>This course will provide research experience under the supervision of a Departmental staff member. The goal is to deepen the students understanding of the scientific basis and practical techniques relevant to modern pharmaceutical development. Not eligible for CR/NCR option.</p>Prerequisite:\r\n                    Permission of the Department and the Course CoordinatorDistribution Requirement Status:  This is a Science courseBreadth Requirement:  Living Things and Their Environment (4)\r\n", "LEC": 0, "course_name": "Pharmaceutical Chemistry Research ", "name": "Pharm Chem Research", "TUT": 0, "PRA": 144, "wintersections": {"L0101": ["N", "R", "K. Pang", [["", "TBA"]], "", "40"]}, "SC": "Y", "CR": 1, "course_code": "PHC489Y1", "SEM": 0}, "TRN419Y1": {"course_description": "<p>The origins and evolution of American, British and Canadian foreign policy from the late 18th century to the present. Policies are compared in order to understand the development of these countries as nations and actors in the international community.\r\nPrerequisite:\r\n                    Students must have a background in one of Canadian, British or American history.Distribution Requirement Status:  This is a Humanities or Social Science courseBreadth Requirement:  Society and its Institutions (3)\r\n", "LEC": 0, "course_name": "Comparative American, British and Canadian Foreign Policy", "name": "Comp Foreign Policy", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["N", "PE", "Bothwell/Kislenko", [["LA 212", ["R", 10, 12]]], "", "15"]}, "SC": "Y", "CR": 1, "course_code": "TRN419Y1", "SEM": 48}, "CLA366H1": {"course_description": "<p>Topics vary from year to year.\r\nPrerequisite:\r\n                    <a href=\"crs_cla.htm#CLA160H1\">CLA160H1</a> + 1 of <a href=\"crs_cla.htm#CLA230H1\">CLA230H1</a>/<a href=\"crs_cla.htm#CLA260H1\">CLA260H1</a>Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Society and its Institutions (3)\r\n", "LEC": 0, "course_name": "Topics in the Study of Greek History", "TUT": 0, "PRA": 0, "CR": 0.5, "course_code": "CLA366H1", "SEM": 36}, "STR262H0": {"course_description": "<p>Students build on their understanding of translation in specialized fields. They continue to acquire specialized translation strategies. They increase and apply their knowledge of research tools and resources, learn techniques for resolving translation problems, and practice appropriate English usage. (Co-listed as GL/TRAN 2220 Glendon College)\r\nPrerequisite:\r\n                    SLA261H0; permission of DepartmentDistribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 0, "course_name": "Introduction to Translation into English II ", "TUT": 0, "PRA": 36, "CR": 0.5, "course_code": "STR262H0", "SEM": 0}, "HPS301H1": {"course_description": "<p>This course will cover diverse topics in the history of science from Antiquity until present. It may focus on specific-time periods, fields of inquiry, individuals, scientific institutions, or geographic locations.\r\nDistribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 24, "course_name": "Topics in the History of Science", "name": "Top: History of Science", "TUT": 12, "PRA": 0, "wintersections": {"L5101": ["Cancel"]}, "SC": "F", "CR": 0.5, "course_code": "HPS301H1", "SEM": 0}, "SLA452Y1": {"course_description": "<p>The phonology, morphology and syntax of contemporary standard Russian from a formal and semantic standpoint.\r\nPrerequisite:\r\n                    <a href=\"crs_sla.htm#SLA320Y1\">SLA320Y1</a>Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Thought, Belief and Behaviour (2)\r\n", "LEC": 0, "course_name": "Structure of Russian", "TUT": 0, "PRA": 0, "CR": 1, "course_code": "SLA452Y1", "SEM": 48}, "FAH492Y1": {"course_description": "<p>Independent Studies in Medieval Art and Architecture. Not eligible for CR/NCR option.\r\nDistribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 0, "course_name": "        Independent Studies in Medieval Art and Architecture ", "name": "Ind. Studies: Medieval", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["N", "E", "Tba", [["", "TBA"]], "", "9999"]}, "SC": "Y", "CR": 1, "course_code": "FAH492Y1", "SEM": 0}, "CIV455H1": {"course_description": "<p>The first of two integrated design project courses that are focussed on a single problem that has both transportation and structural design elements. This course emphasizes transportation engineering design. However, consideration of structural engineering aspects are included, in preparation for the second course in the series. Emphasis is on an integrated design process from conceptual design through to a constructible plan which addresses the functional, economic, aesthetic and environmental aspects of the problem.</p><br>\n", "LEC": 12.0, "course_name": "Collaborative Design Project I", "fallsections": {"PRA0101": ["", "", "", [["SF3202", ["M", 15.0, 18.0]]]], "LEC0101": ["", "", "Coleman, Jesse", [["SF3202", ["R", 15.0, 16.0]]]]}, "TUT": 0.0, "PRA": 36.0, "SC": ["F"], "CR": 0.5, "course_code": "CIV455H1", "SEM": 0}, "ITA350Y1": {"course_description": "<p>For students who have completed <a href=\"crs_ita.htm#ITA250Y1\">ITA250Y1</a>. Discussion of problems of grammar, style, and composition. Language analysis based on readings of Italian authors. One hour a week of oral practice. This course includes a component designed to enhance students' research experience.\r\nPrerequisite:\r\n                    <a href=\"crs_ita.htm#ITA250Y1\">ITA250Y1</a>Exclusion:\r\n                    <a href=\"crs_ita.htm#ITA252Y1\">ITA252Y1</a>/<a href=\"crs_ita.htm#ITA351Y1\">ITA351Y1</a>/ITA352Y1/ITA343H1/ITA344H1/ITA354H1/ITA355H1/ITA364H1/ITA365H1Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 0, "course_name": "Language Practice (formerly ITA343H1, ITA344H1)", "name": "Language Practice I", "TUT": 0, "PRA": 24, "wintersections": {"L5101": ["Y", "", "Scarci/Tesi", [["NF 007", ["M", 18, 21]]], "", "35"]}, "SC": "Y", "CR": 1, "course_code": "ITA350Y1", "SEM": 48}, "FRE334H1": {"course_description": "<p>Through films from across the spectrum of the Francophone world, a study of the diversity of the French colonial empire as well as the different aesthetic, historical, and cultural effects of colonialism and post-independence experience on various cinematic representations. (Not offered in 2014-15; offered in alternate years).\r\nPrerequisite:\r\n                    <a href=\"crs_fre.htm#FRE240H1\">FRE240H1</a>Recommended Preparation:\r\n                    <a href=\"crs_fre.htm#FRE241H1\">FRE241H1</a>Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 24, "course_name": "Francophone Cinema", "TUT": 0, "PRA": 0, "CR": 0.5, "course_code": "FRE334H1", "SEM": 0}, "EAS366H1": {"course_description": "<p>A thematic introduction to some of China's major literary texts by taking as our guide the lover and the madman as both writer and subject. We will use the idea of lover and madman to explore issues such as social and behavioral boundaries, desire, violence, narrative compulsion, and the re-imagination of tradition.\r\nPrerequisite:\r\n                    <a href=\"crs_eas.htm#EAS209H1\">EAS209H1</a>Distribution Requirement Status:  This is a Humanities courseBreadth Requirement:  Creative and Cultural Representations (1)\r\n", "LEC": 24, "course_name": " Madmen in Chinese Literature", "TUT": 0, "PRA": 0, "CR": 0.5, "course_code": "EAS366H1", "SEM": 0}, "NEW451H1": {"course_description": "<p>An upper level course. Topics of study vary from year to year.\r\nPrerequisite:\r\n                    <a href=\"crs_new.htm#NEW250Y1\">NEW250Y1</a>/<a href=\"crs_pol.htm#POL301Y1\">POL301Y1</a>/permission of instructorDistribution Requirement Status:  This is a Humanities or Social Science courseBreadth Requirement:  None\r\n", "LEC": 24, "course_name": "Special Topics in African Studies", "name": "Special Top Africa\r\n      (Post-Colonial African Cities: Livelihoods, Politics and Citizenship)\r\n      (note: title change)", "TUT": 0, "PRA": 0, "wintersections": {"L0101": ["Y", "P", "D. Eyoh", [["WE 54", ["T", 14, 16]]], "", "25"]}, "SC": "F", "CR": 0.5, "course_code": "NEW451H1", "SEM": 0}, "MSE450H1": {"course_description": "<p>Analysis of plant design factors involved in the processing of materials. Topics considered include the principles of plant design, optimal allocation of resources and costs, minimizing energy requirements for new plant designs, as well as process innovations for existing plants. A case study approach will be used, employing industrial examples. The course material will be reinforced by a plant tour, visit to an engineering office, and guest lectures by industry experts.</p><br>\n", "LEC": 24.0, "course_name": "Plant Design for Materials Process Industries", "fallsections": {"TUT0101": ["", "", "", [["SF2202", ["W", 9.0, 12.0]]]], "LEC0101": ["", "", "Young, Jack and Wheeler, Frank", [["RS310", ["T", 12.0, 14.0]]]]}, "TUT": 36.0, "PRA": 0.0, "SC": ["F"], "CR": 0.5, "course_code": "MSE450H1", "SEM": 0}}